%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%    Install Basic Bootstrap    %%%
Running /home/mikey/vision-open-source/software/builds/current/bin/batchvision with scripts from /home/mikey/vision-open-source/application/localvision/bootstrap/protocol/originals in /home/mikey/vision-open-source/application/localvision/bootstrap/investNet/NDF
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Building /home/mikey/vision-open-source/application/localvision/bootstrap/investNet using /home/mikey/vision-open-source/software/builds/current/bin/batchvision with scripts from /home/mikey/vision-open-source/application/localvision/bootstrap/protocol/originals 
---> Installing BootStrap
Mon Jan 16 12:57:44 EST 2017
BEGIN bootstrap creation:
...'Nil' Created and Saved
...'BuiltInObjectPArray' Created
...'Scalar P-Token' Created
...'Selector P-Token' Created
...'Object' created
...'Undefined' Created
...after Cleanup
DONE


>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
>>>  WARNING: Normal System Operation Not Available in BootStrap Mode  <<<
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> 
*******************
*******************
*****  Setup  *****
*******************
*******************

***************************************
*****  Q-Register Symbolic Names  *****
***************************************

***********************************************
*****  Primitively Boot Strapped Objects  *****
***********************************************

******************************
******************************
*****  Function Classes  *****
******************************
******************************

************************
*****  'Function'  *****
************************

***************************************
*****  Computed Function Classes  *****
***************************************

************************
*  'ComputedFunction'  *
************************

*******************
*  'PrimitiveFn'  *
*******************

**************************************************************************
*  'Function', 'ComputedFunction', and 'PrimitiveFn' Method Definitions  *
**************************************************************************

*****  'Function'  *****

*****  'ComputedFunction'  *****

*****  'PrimitiveFn'  *****

***************
*  'Closure'  *
***************

**************
*  'Method'  *
**************

*****************************************
*****  Enumerated Function Classes  *****
*****************************************

**************************
*  'EnumeratedFunction'  *
**************************

*************
*  'Value'  *
*************

******************
*  'Collection'  *
******************

***************************
*  'SequencedCollection'  *
***************************

************
*  'List'  *
************

*************************
*  'IndexedCollection'  *
*************************

******************
*  'TimeSeries'  *
******************

*******************
*  'IndexedList'  *
*******************

************************************
************************************
*****  Undefined Data Classes  *****
************************************
************************************

***************
*  'NoValue'  *
***************

****************************
****************************
*****  Symbol Classes  *****
****************************
****************************

**************
* 'Selector' *
**************

*****************************
*****************************
*****  Boolean Classes  *****
*****************************
*****************************

***************
*  'Boolean'  *
***************

************
*  'True'  *
************

*************
*  'False'  *
*************

******************************
******************************
*****  Ordinal Classes  ******
******************************
******************************

***************
*  'Ordinal'  *
***************

**************
*  'Number'  *
**************

**************
*  'Double'  *
**************

*************
*  'Float'  *
*************

***************
*  'Integer'  *
***************

************
*  'Date'  *
************

*****************
*  'Character'  *
*****************

**************
*  'String'  *
**************

********************************************
********************************************
*****  Property Classes and Instances  *****
********************************************
********************************************

****************
*  'Property'  *
****************

*****  The Default Properties  *****

***************************
*  'TimeVaryingProperty'  *
***************************

*****  The Default Time Varying Properties  *****

*******************************
*******************************
*****  Dictionary Access  *****
*******************************
*******************************

*****  'Closure'  *****

*****  'Method'  *****

*****  'Value'  *****

*****  'TimeSeries'  *****

*****  'IndexedList'  *****

*****  'List'  *****

*****  'Selector'  *****

*****  'String'  *****

*******************************
*******************************
*  Root Environment Creation  *
*******************************
*******************************

****************************
****************************
*****  Space Creation  *****
****************************
****************************

*************************
*****  System Root  *****
*************************
Network Update Status: Update Operation Successful

***********************
*****  User Root  *****
***********************
Space Creation Status: Update Operation Successful
Network Update Status: Update Operation Successful

******************
******************
*****  Done  *****
******************
******************

V> ---> Installing BuiltInClasses
Mon Jan 16 12:57:44 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> *****  Allocate Q-Registers  *****
*****  Initialize Q-Registers  *****
*****  Access 'TRUE', 'FALSE', and 'NA'  *****
*****  Access the Default Property Types  *****
*****  Access Prototypes  *****
-----  Primitive  -----
-----  List  -----
-----  TimeSeries  -----
-----  IndexedList  -----
-----  Character  -----
*****  Align the 'Prototypical' V-Store  *****

V> V> 
##################
####  Object  ####
##################

V> V> 
###################
####  Boolean  ####
###################

V> 
##############################
####  Property BuiltIn Protocol  ####
##############################

V> V> 
####################
####  Function  ####
####################

V> 
############################
####  ComputedFunction  ####
############################

V> 
###################
####  Closure  ####
###################

V> 
##################
####  Method  ####
##################

V> 
#####################
####  Primitive  ####
#####################

V> 
##############################
####  EnumeratedFunction  ####
##############################

V> 
######################
####  Collection  ####
######################

V> 
#############################
####  IndexedCollection  ####
#############################

V> 
#######################
####  IndexedList  ####
#######################

V> 
######################
####  TimeSeries  ####
######################

V> 
###############################
####  SequencedCollection  ####
###############################

V> 
################
####  List  ####
################

V> 
#################
####  Value  ####
#################

V> V> 
###################
####  Ordinal  ####
###################

V> 
#####################
####  Character  ####
#####################

V> 
################
####  Date  ####
################

V> 
##################
####  Number  ####
##################

V> 
##################
####  Double  ####
##################

V> 
#################
####  Float  ####
#################

V> 
###################
####  Integer  ####
###################

V> 
##################
####  String  ####
##################

V> V> 
####################
####  Selector  ####
####################

V> 
#####################
####  Undefined  ####
#####################

V> V> 
####################
####  BuiltIn Class Non-Primitive Creation 
####################

V> 
##############################
####  DateRange Protocol  ####
##############################

V> 
###############################
####  DateOffset Protocol  ####
###############################

V> 
############################
####  Utility Protocol  ####
############################

############################
####  Utility UnixSeconds Protocol  ####
############################

V> V> V> V> V> V> 
####################
###  Installation of Standard Messages at All BuiltIn Classes
####################

>>> Object Network Updated <<<

V> V> ---> Installing Core Classes and Protocol
Mon Jan 16 12:57:45 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> 
####################
####  Core Class Creation 
####################

V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> 
####################
#  Catalog and Related Protocol
####################


####################
#  Chain and Related Protocol
####################


####################
#  Descriptor: Protocol
####################


####################
#  Dictionary: Protocol
####################


####################
#  Entity: Protocol
####################


####################
#  IncorporatorPrototype and Related Protocol
####################


####################
#  Specification and Related Protocol
####################


####################
#  ToolKit and Related Protocol
####################


####################
#  UserEnvironment and Related Protocol
####################


####################
#  Descriptor: Protocol for Subclasses
####################


#-->  Date DayOfWeekDescriptor

#-->  Date MonthDescriptor 


####################
#  Dictionary: Protocol for Subclasses
####################


#-->  Environment


#-->  SystemDictionary


####################
#  ToolKit: Protocol for Subclasses
####################


#-->  Environment MaintenanceTools

#-->  PrinterTools Descriptor
>>> Object Network Updated <<<

V> V> ---> Installing DDMS Object Space
Mon Jan 16 12:57:45 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> ...  Creating Space #4  
 For: Data Dictionary Management System
>>> Object Space 4 Created <<<
>>> Object Network Updated <<<

V> V> ---> Installing Schema Support Classes
Mon Jan 16 12:57:45 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> >>> Object Network Updated <<<

V> V> ---> Installing Schema Classes 
Mon Jan 16 12:57:45 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> 
####################
#  Create Schema Object Space
####################
...  Creating Space #5  
 For: Schema Management Tools

####################
#  INItialize schema classes
####################

####################
#  Schema Extensions: Global Changes at Object
####################

####################
#  Schema Extensions: Global Changes at Dictionary
####################

####################
#  Schema Extensions: Global Changes at Entity
####################

####################
#  Schema Extensions: Global Changes at Environment MaintenanceTools
####################

#################################
#   Schema DEFs Required for defining Core Classes
#################################
>>> Object Space 5 Created <<<
>>> Object Network Updated <<<

V> V> ---> Installing Schema Protocol
Mon Jan 16 12:57:45 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> 
####################
#  Schema: Object
####################

####################
#  Schema: Object Spaces
####################
Adding Object Space: Environment DBA DDMS
Adding Object Space: Environment DBA Schema

####################
#  Schema: Core - general
####################

####################
#  Schema: Core - schema classes
####################
Schema Message Cross Reference Last Updated:       NA 
---  Current Counts  ---
CD:              80
MD:               0
MID:              0

---  Classes To Update  ---
Object
Boolean
FALSE
TRUE
DateRange
FixedProperty
TimeSeriesProperty
Function
ComputedFunction
Block
Method
Primitive
EnumeratedFunction
Collection
IndexedCollection
IndexedList
TimeSeries
SequencedCollection
List
Value
Ordinal
Character
Date
DateOffset
BusinessDays
Days
MonthBeginnings
MonthEnds
Months
QuarterBeginnings
QuarterEnds
Quarters
YearBeginnings
YearEnds
Years
Number
Double
Float
Integer
String
Selector
Undefined
NoValue
Utility
Utility UnixSeconds
Utility SessionAttribute
BuiltInWorkspace
CoreWorkspace
Environment DBA Schema
Environment DBA DDMS
Catalog
EntityCatalog
ApplicationCatalog
Chain
Chain Link
Descriptor
Date DayOfWeekDescriptor
Date MonthDescriptor
Dictionary
Environment
Named
SystemDictionary
Entity
SystemTable
IncorporatorPrototype
PrivateRecord
Specification
ToolKit
Environment MaintenanceTools
PrinterTools
PrinterTools Descriptor
UserEnvironment
Schema
Schema Descriptor
Schema ClassDescriptor
Schema MessageDescriptor
Schema MessageImplementationDescriptor
MessageType
ClassType
FunctionType
UsageLevel

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:46 EST 2017
---  Current Counts  ---
CD:              80
MD:            1202
MID:           2136

     2136 Created.
     2136 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing DataFeed Object Space
Mon Jan 16 12:57:46 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> ...  Creating Space #6  
 For: Data Feed Management Tools
>>> Object Space 6 Created <<<
>>> Object Network Updated <<<

V> V> ---> Installing Default DataRecord Object Space
Mon Jan 16 12:57:46 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> ...  Creating Space #7  
 For: Default Storage for DataRecord Instances
>>> Object Space 7 Created <<<
>>> Object Network Updated <<<

V> V> ---> Installing OpenVision Protocol
Mon Jan 16 12:57:46 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      Environment
      Named
      SystemDictionary
   Entity
      SystemTable
         ClassType
         FunctionType
         MessageType
         UsageLevel
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
   PrivateRecord
   Selector
   Specification
   ToolKit
      Environment MaintenanceTools
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:46 EST 2017
---  Current Counts  ---
CD:              94
MD:            1202
MID:           2136

---  Classes To Update  ---
Object
Number
Double
Float
Integer
String
CoreWorkspace
Environment DBA DataFeed
Environment DBA DataRecordClasses
OpenVision
OpenVision Channel
OpenVision Constant
OpenVision Channel State
OpenVision Channel Status
OpenVision Channel Error
OpenVision Channel ChannelType
OpenVision Channel Option
OpenVision OptionValue
OpenVision Channel PromptFormat
OpenVision Channel BinaryFormat
OpenVision Channel TrimFormat

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:46 EST 2017
---  Current Counts  ---
CD:              94
MD:            1381
MID:           2412

      276 Created.
      276 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing AdminTools Protocol
Mon Jan 16 12:57:46 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Named
      SystemDictionary
   Entity
      SystemTable
         ClassType
         FunctionType
         MessageType
         UsageLevel
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:46 EST 2017
---  Current Counts  ---
CD:              99
MD:            1381
MID:           2412

---  Classes To Update  ---
Object
Primitive
Date
DateOffset
Double
Float
Integer
Undefined
Utility UnixSeconds
Utility SessionAttribute
BuiltInWorkspace
CoreWorkspace
OpenVision Channel
OpenVision Channel State
OpenVision Channel Status
OpenVision Channel Error
OpenVision Channel ChannelType
OpenVision Channel Option
OpenVision Channel PromptFormat
OpenVision Channel BinaryFormat
OpenVision Channel TrimFormat
AdminTools
AdminTools Named
AdminTools ObjectSpace
AdminTools _POP
AdminTools ClusterType

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:47 EST 2017
---  Current Counts  ---
CD:              99
MD:            1473
MID:           2583

      171 Created.
      171 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing Interface Protocol
Mon Jan 16 12:57:47 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      Named
      SystemDictionary
   Entity
      SystemTable
         ClassType
         FunctionType
         MessageType
         UsageLevel
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:47 EST 2017
---  Current Counts  ---
CD:             131
MD:            1473
MID:           2583

---  Classes To Update  ---
Object
CoreWorkspace
FormatToolProtocol
Interface
Interface Named
Interface Constant
Interface Global
Interface ErrorLog
Interface External
Interface Workspace
Interface ExtractWS
Interface ApplicationWS
FormatToolProtocol Html
Interface HtmlAccess
LayoutTools
LayoutTools Named
LayoutTools Specification
LayoutTools Component
LayoutTools TableSpec
LayoutTools TableSpec Label
LayoutTools TableSpec ColumnSpec
LayoutTools FormSpec
LayoutTools FormSpec InputSpec
LayoutTools GraphSpec
LayoutTools Piechart
LayoutTools Barchart
LayoutTools Linechart
LayoutTools GraphSpec Label
LayoutTools GraphSpec Axis
LayoutTools Piechart Slice
LayoutTools Barchart DataSet
LayoutTools Linechart DataSet
ProcessControlTools
ProcessControlTools ExternalProgram

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:47 EST 2017
---  Current Counts  ---
CD:             131
MD:            2004
MID:           3493

      910 Created.
      910 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing Incorporator Class Tools
Mon Jan 16 12:57:47 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
   Entity
      DataSource
      SystemTable
         ClassType
         FunctionType
         MessageType
         UpdateType
         UsageLevel
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
      DataSet
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:47 EST 2017
---  Current Counts  ---
CD:             137
MD:            2019
MID:           3510

---  Classes To Update  ---
Object
CoreWorkspace
IncorporatorPrototype
DataSource
UpdateType
DBEntity
LocalDBDictionary
DataFeed
DataSet

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             137
MD:            2215
MID:           3771

      261 Created.
      276 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing 6.0 Protocol
Mon Jan 16 12:57:48 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
   Entity
      DataSource
      SystemTable
         ClassType
         FunctionType
         MessageType
         UpdateType
         UsageLevel
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
      DataSet
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
      Time
         HighResolutionTime
         LowResolutionTime
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             140
MD:            2215
MID:           3760

---  Classes To Update  ---
Object
DateRange
TimeSeries
Value
Date
DateOffset
BusinessDays
Days
MonthBeginnings
MonthEnds
Months
QuarterBeginnings
QuarterEnds
Quarters
YearBeginnings
YearEnds
Years
Number
Undefined
Utility UnixSeconds
CoreWorkspace
Time
LowResolutionTime
HighResolutionTime

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             140
MD:            2300
MID:           3947

      187 Created.
      210 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing EXTcore.patch, EXTcore.INI, EXTcore.DEF
Mon Jan 16 12:57:48 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             162
MD:            2305
MID:           3952

---  Classes To Update  ---
Object
CoreWorkspace
Entity
Currency
Classification
RangeClassification
Universe
Table
Support
DataItem
DataAccessPath
IdSource
XRef
VendorEntity
DataRecord
LinkRecord
Bridge
LocalEntity
Currency XRef
EstimateBridge
EstimateRecord
AnalystEstimateRecord
ConsensusEstimateRecord
SummaryEstimateBridge
DetailEstimateBridge

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             162
MD:            2369
MID:           4163

      211 Created.
      216 Refreshed.
Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             162
MD:            2372
MID:           4166

---  Classes To Update  ---
Object
String
CoreWorkspace
Named
Entity
Currency
Classification
RangeClassification
Universe
DataItem
DataAccessPath
IdSource
XRef
VendorEntity
DataRecord
LinkRecord
Bridge
LocalEntity
DetailEstimateBridge

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             162
MD:            2459
MID:           4326

      160 Created.
      180 Refreshed.

V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   Bridge
      EstimateBridge
         DetailEstimateBridge
         SummaryEstimateBridge
      LocalEntity
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DataRecord
      EstimateRecord
         AnalystEstimateRecord
         ConsensusEstimateRecord
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
      XRef
         Currency XRef
   Entity
      Classification
         RangeClassification
      Currency
      DataSource
      Support
         DataAccessPath
         DataItem
         IdSource
      SystemTable
         ClassType
         FunctionType
         MessageType
         UpdateType
         UsageLevel
      Table
      Universe
      VendorEntity
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
      DataSet
   LinkRecord
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
      Time
         HighResolutionTime
         LowResolutionTime
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             162
MD:            2459
MID:           4326

---  Classes To Update  ---

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             162
MD:            2459
MID:           4326

        0 Created.
        0 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing Documentation
Mon Jan 16 12:57:48 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   Bridge
      EstimateBridge
         DetailEstimateBridge
         SummaryEstimateBridge
      LocalEntity
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DataRecord
      EstimateRecord
         AnalystEstimateRecord
         ConsensusEstimateRecord
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
      XRef
         Currency XRef
   Entity
      Classification
         RangeClassification
      Currency
      DataSource
      Support
         DataAccessPath
         DataItem
         IdSource
      SystemTable
         ClassType
         FunctionType
         MessageType
         UpdateType
         UsageLevel
      Table
      Universe
      VendorEntity
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
      DataSet
   LinkRecord
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
      Time
         HighResolutionTime
         LowResolutionTime
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:48 EST 2017
---  Current Counts  ---
CD:             162
MD:            2459
MID:           4326

---  Classes To Update  ---

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:50 EST 2017
---  Current Counts  ---
CD:             162
MD:            2459
MID:           4326

        0 Created.
        0 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing CLEANschema.G
Mon Jan 16 12:57:50 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> ...  installing string clusters for each CD
...  saving new structures so instances needing strings in indexed list
      are not installed in same update
>>> Object Network Updated <<<
...  reclustering MID implementationSource
Cluster:  20996394     2696     4338     2696[   5, 24874]
classDescriptor                163 | ClassDescriptor                  1
 --> not merged: classDescriptor                Constant        Schema
 --> not merged: ClassDescriptor                Constant        Schema

messageDescriptor                1 | MessageDescriptor                1
  --> merged: MessageDescriptor              Constant        Schema

named                           18 | Named                            5
  --> merged: Named                          Constant        CoreWorkspace
  --> merged: Named                          Constant        PrinterTools Descriptor
  --> merged: Named                          Constant        AdminTools
  --> merged: Named                          Constant        Interface
  --> merged: Named                          Constant        LayoutTools

functionType                     2 | FunctionType                     2
  --> merged: FunctionType                   Constant        CoreWorkspace
  --> merged: FunctionType                   Constant        Named

messageType                      1 | MessageType                      2
  --> merged: MessageType                    Constant        CoreWorkspace
  --> merged: MessageType                    Constant        Named

usageLevel                       2 | UsageLevel                       2
  --> merged: UsageLevel                     Constant        CoreWorkspace
  --> merged: UsageLevel                     Constant        Named

link                             1 | Link                             1
  --> merged: Link                           Constant        Chain

dictionary                       1 | Dictionary                       1
  --> merged: Dictionary                     Constant        CoreWorkspace

entity                           2 | Entity                           1
  --> merged: Entity                         Constant        CoreWorkspace

environment                      1 | Environment                      2
  --> merged: Environment                    Constant        CoreWorkspace
  --> merged: Environment                    Constant        ProcessControlTools

businessDays                     1 | BusinessDays                     1
  --> merged: BusinessDays                   Constant        BuiltInWorkspace

date                             3 | Date                             1
  --> merged: Date                           Constant        BuiltInWorkspace

days                             1 | Days                             1
  --> merged: Days                           Constant        BuiltInWorkspace

list                             1 | List                             1
  --> merged: List                           Constant        BuiltInWorkspace

monthBeginnings                  1 | MonthBeginnings                  1
  --> merged: MonthBeginnings                Constant        BuiltInWorkspace

monthEnds                        1 | MonthEnds                        1
  --> merged: MonthEnds                      Constant        BuiltInWorkspace

months                           1 | Months                           1
  --> merged: Months                         Constant        BuiltInWorkspace

number                           8 | Number                           1
 --> not merged: number                         Constant        BuiltInWorkspace
 --> not merged: Number                         Constant        BuiltInWorkspace

object                           1 | Object                           1
  --> merged: Object                         Constant        BuiltInWorkspace

quarterBeginnings                1 | QuarterBeginnings                1
  --> merged: QuarterBeginnings              Constant        BuiltInWorkspace

quarterEnds                      1 | QuarterEnds                      1
  --> merged: QuarterEnds                    Constant        BuiltInWorkspace

quarters                         1 | Quarters                         1
  --> merged: Quarters                       Constant        BuiltInWorkspace

selector                         2 | Selector                         1
  --> merged: Selector                       Constant        BuiltInWorkspace

value                            4 | Value                            1
  --> merged: Value                          FixedProperty   BuiltInWorkspace

yearBeginnings                   1 | YearBeginnings                   1
  --> merged: YearBeginnings                 Constant        BuiltInWorkspace

yearEnds                         1 | YearEnds                         1
  --> merged: YearEnds                       Constant        BuiltInWorkspace

years                            1 | Years                            1
  --> merged: Years                          Constant        BuiltInWorkspace

isTRUE                           2 | isTrue                           2
 --> not merged: isTRUE                         Constant        Object
 --> not merged: isTrue                         Constant        Object
 --> not merged: isTRUE                         Constant        TRUE
 --> not merged: isTrue                         Constant        TRUE

isFALSE                          2 | isFalse                          2
 --> not merged: isFALSE                        Constant        Object
 --> not merged: isFalse                        Constant        Object
 --> not merged: isFALSE                        Constant        FALSE
 --> not merged: isFalse                        Constant        FALSE

binaryFormat                     1 | BinaryFormat                     2
  --> merged: BinaryFormat                   Constant        OpenVision Channel Option
 --> not merged: binaryFormat                   Method          OpenVision Channel
 --> not merged: BinaryFormat                   Constant        OpenVision Channel

promptFormat                     1 | PromptFormat                     2
  --> merged: PromptFormat                   Constant        OpenVision Channel Option
 --> not merged: promptFormat                   Method          OpenVision Channel
 --> not merged: PromptFormat                   Constant        OpenVision Channel

seekOffset                       1 | SeekOffset                       1
  --> merged: SeekOffset                     Constant        OpenVision Channel Option

tcpNoDelay                       1 | TCPNoDelay                       1
  --> merged: TCPNoDelay                     Constant        OpenVision Channel Option

trimFormat                       1 | TrimFormat                       2
  --> merged: TrimFormat                     Constant        OpenVision Channel Option
 --> not merged: trimFormat                     Method          OpenVision Channel
 --> not merged: TrimFormat                     Constant        OpenVision Channel

channelType                      1 | ChannelType                      1
 --> not merged: channelType                    Method          OpenVision Channel
 --> not merged: ChannelType                    Constant        OpenVision Channel

option                           1 | Option                           1
 --> not merged: option                         Method          OpenVision Channel
 --> not merged: Option                         Constant        OpenVision Channel

state                            3 | State                            1
 --> not merged: state                          Method          OpenVision Channel
 --> not merged: State                          Constant        OpenVision Channel

status                           1 | Status                           1
 --> not merged: status                         Method          OpenVision Channel
 --> not merged: Status                         Constant        OpenVision Channel

hostname                         1 | HostName                         1
  --> merged: HostName                       Primitive       OpenVision

clusterType                      1 | ClusterType                      2
  --> merged: ClusterType                    Constant        AdminTools
  --> merged: ClusterType                    Constant        AdminTools Named

objectSpace                      2 | ObjectSpace                      1
  --> merged: ObjectSpace                    Constant        AdminTools

label                            4 | Label                            2
  --> merged: Label                          Constant        LayoutTools TableSpec
  --> merged: Label                          Constant        LayoutTools GraphSpec

profile                         28 | Profile                          1
 --> not merged: profile                        Method          Interface ApplicationWS
 --> not merged: Profile                        Method          Interface ApplicationWS

workSpace                        1 | Workspace                        1
  --> merged: Workspace                      Constant        Interface

dbEntity                         1 | DBEntity                         1
  --> merged: DBEntity                       Constant        CoreWorkspace

dataSource                       2 | DataSource                       2
  --> merged: DataSource                     Constant        CoreWorkspace
  --> merged: DataSource                     Constant        Named

updateType                       1 | UpdateType                       2
  --> merged: UpdateType                     Constant        CoreWorkspace
  --> merged: UpdateType                     Constant        Named

currency                         7 | Currency                         2
  --> merged: Currency                       Constant        Named
 --> not merged: currency                       Constant        CoreWorkspace
 --> not merged: Currency                       Constant        CoreWorkspace

localEntity                      1 | LocalEntity                      1
  --> merged: LocalEntity                    Constant        CoreWorkspace

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:50 EST 2017
---  Current Counts  ---
CD:             163
MD:            2423
MID:           4310

---  Classes To Update  ---
Object
CoreWorkspace
Schema
Schema ClassDescriptor
Schema MessageDescriptor
Schema MessageImplementationDescriptor
MessageType
ClassType
KeyType

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:50 EST 2017
---  Current Counts  ---
CD:             163
MD:            2456
MID:           4365

       55 Created.
       77 Refreshed.

V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   Bridge
      EstimateBridge
         DetailEstimateBridge
         SummaryEstimateBridge
      LocalEntity
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DataRecord
      EstimateRecord
         AnalystEstimateRecord
         ConsensusEstimateRecord
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
      XRef
         Currency XRef
   Entity
      Classification
         RangeClassification
      Currency
      DataSource
      Support
         DataAccessPath
         DataItem
         IdSource
      SystemTable
         ClassType
         FunctionType
         KeyType
         MessageType
         UpdateType
         UsageLevel
      Table
      Universe
      VendorEntity
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
      DataSet
   LinkRecord
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
      Time
         HighResolutionTime
         LowResolutionTime
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:50 EST 2017
---  Current Counts  ---
CD:             163
MD:            2456
MID:           4365

---  Classes To Update  ---

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:50 EST 2017
---  Current Counts  ---
CD:             163
MD:            2456
MID:           4365

        0 Created.
        0 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing Matrix.core
Mon Jan 16 12:57:50 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   Bridge
      EstimateBridge
         DetailEstimateBridge
         SummaryEstimateBridge
      LocalEntity
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DataRecord
      EstimateRecord
         AnalystEstimateRecord
         ConsensusEstimateRecord
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
      XRef
         Currency XRef
   Entity
      Classification
         RangeClassification
      Currency
      DataSource
      Support
         DataAccessPath
         DataItem
         IdSource
      SystemTable
         ClassType
         FunctionType
         KeyType
         MessageType
         UpdateType
         UsageLevel
      Table
      Universe
      VendorEntity
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
      DataSet
   LinkRecord
   Matrix
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
      Time
         HighResolutionTime
         LowResolutionTime
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:50 EST 2017
---  Current Counts  ---
CD:             164
MD:            2456
MID:           4365

---  Classes To Update  ---
Object
CoreWorkspace
Matrix

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:50 EST 2017
---  Current Counts  ---
CD:             164
MD:            2481
MID:           4400

       35 Created.
       35 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing DataFeed protocol
Mon Jan 16 12:57:51 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:50 EST 2017
---  Current Counts  ---
CD:             187
MD:            2501
MID:           4420

---  Classes To Update  ---
Object
CoreWorkspace
Environment DBA DataFeed
DataFeed
GlobalsFeed
MasterFeed
EntityExtenderFeed
TransactionFeed
MembershipFeed
AliasFeed
XRefFeed
RangeGroupFeed
SchemaFeeds
ClassSetup
PropertySetup
MessageSetup
DataFeedSetup
MasterFeedSetup
EntityExtenderFeedSetup
TransactionFeedSetup
MembershipFeedSetup
AliasFeedSetup
XRefFeedSetup
RangeGroupFeedSetup
CurrencyMaster
UniverseMaster
UniverseMembers

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:51 EST 2017
---  Current Counts  ---
CD:             187
MD:            2727
MID:           4993

      573 Created.
      593 Refreshed.

V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   Bridge
      EstimateBridge
         DetailEstimateBridge
         SummaryEstimateBridge
      LocalEntity
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DataRecord
      EstimateRecord
         AnalystEstimateRecord
         ConsensusEstimateRecord
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
      XRef
         Currency XRef
   Entity
      Classification
         RangeClassification
      Currency
      DataSource
      Support
         DataAccessPath
         DataItem
         IdSource
      SystemTable
         ClassType
         FunctionType
         KeyType
         MessageType
         UpdateType
         UsageLevel
      Table
      Universe
      VendorEntity
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
         AliasFeed
         EntityExtenderFeed
         GlobalsFeed
         MasterFeed
            CurrencyMaster
            UniverseMaster
         MembershipFeed
            UniverseMembers
         RangeGroupFeed
         SchemaFeeds
            ClassSetup
            DataFeedSetup
               AliasFeedSetup
               EntityExtenderFeedSetup
               MasterFeedSetup
               MembershipFeedSetup
               RangeGroupFeedSetup
               TransactionFeedSetup
               XRefFeedSetup
            MessageSetup
            PropertySetup
         TransactionFeed
         XRefFeed
      DataSet
   LinkRecord
   Matrix
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
      Time
         HighResolutionTime
         LowResolutionTime
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface ExternalFeedManager
               Interface BatchFeedManager
               Interface DBAdminManager
               Interface ExcelManager
               Interface SqlManager
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:51 EST 2017
---  Current Counts  ---
CD:             192
MD:            2727
MID:           4993

---  Classes To Update  ---
Object
Interface
DataFeed
GlobalsFeed
MasterFeed
EntityExtenderFeed
MembershipFeed
AliasFeed
XRefFeed
RangeGroupFeed
PropertySetup
MessageSetup
DataFeedSetup
Interface ExternalFeedManager
Interface ExcelManager
Interface SqlManager
Interface DBAdminManager
Interface BatchFeedManager

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:51 EST 2017
---  Current Counts  ---
CD:             192
MD:            2769
MID:           5105

      112 Created.
      112 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Installing Navigator Application
Mon Jan 16 12:57:51 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   Bridge
      EstimateBridge
         DetailEstimateBridge
         SummaryEstimateBridge
      LocalEntity
   BuiltInWorkspace
      CoreWorkspace
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DataRecord
      EstimateRecord
         AnalystEstimateRecord
         ConsensusEstimateRecord
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
      XRef
         Currency XRef
   Entity
      Classification
         RangeClassification
      Currency
      DataSource
      Support
         DataAccessPath
         DataItem
         IdSource
      SystemTable
         ClassType
         FunctionType
         KeyType
         MessageType
         UpdateType
         UsageLevel
      Table
      Universe
      VendorEntity
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
         AliasFeed
         EntityExtenderFeed
         GlobalsFeed
         MasterFeed
            CurrencyMaster
            UniverseMaster
         MembershipFeed
            UniverseMembers
         RangeGroupFeed
         SchemaFeeds
            ClassSetup
            DataFeedSetup
               AliasFeedSetup
               EntityExtenderFeedSetup
               MasterFeedSetup
               MembershipFeedSetup
               RangeGroupFeedSetup
               TransactionFeedSetup
               XRefFeedSetup
            MessageSetup
            PropertySetup
         TransactionFeed
         XRefFeed
      DataSet
   LinkRecord
   Matrix
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
      Time
         HighResolutionTime
         LowResolutionTime
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface ExternalFeedManager
               Interface BatchFeedManager
               Interface DBAdminManager
               Interface ExcelManager
               Interface SqlManager
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:51 EST 2017
---  Current Counts  ---
CD:             192
MD:            2769
MID:           5105

---  Classes To Update  ---
Entity
Schema ClassDescriptor
Schema MessageImplementationDescriptor
Interface ApplicationWS
DataFeed
EstimateBridge
SummaryEstimateBridge

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:52 EST 2017
---  Current Counts  ---
CD:             192
MD:            2814
MID:           5153

       48 Created.
       51 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Creating NDF.JOURNAL file
--->  Compacting network /home/mikey/vision-open-source/application/localvision/bootstrap/investNet/NDF using /home/mikey/vision-open-source/application/localvision/adminScripts
Mon Jan 16 12:57:52 EST 2017
...  version history prior to compact
Version   Role     Segment    Commit Time       Annotation
12128     Valid      2/22     01/16/17:12:57:52 
12128     Valid      3/24     01/16/17:12:57:52 
12128     Valid      5/28     01/16/17:12:57:52 
11704     Valid      2/21     01/16/17:12:57:51 
11704     Valid      3/23     01/16/17:12:57:51 
11704     Valid      4/11     01/16/17:12:57:51 
11704     Valid      5/26     01/16/17:12:57:51 
11704     Valid      6/3      01/16/17:12:57:51 
11068     Valid      2/20     01/16/17:12:57:51 
11068     Valid      3/21     01/16/17:12:57:51 
11068     Valid      4/10     01/16/17:12:57:51 
11068     Valid      5/24     01/16/17:12:57:51 
10552     Valid      2/19     01/16/17:12:57:50 
10552     Valid      3/20     01/16/17:12:57:50 
10552     Valid      4/9      01/16/17:12:57:50 
10552     Valid      5/22     01/16/17:12:57:50 
10036     Valid      2/18     01/16/17:12:57:50 
10036     Valid      3/19     01/16/17:12:57:50 
10036     Valid      5/20     01/16/17:12:57:50 
9612      Valid      2/17     01/16/17:12:57:50 
9612      Valid      3/17     01/16/17:12:57:50 
9612      Valid      5/19     01/16/17:12:57:50 
9188      Valid      2/16     01/16/17:12:57:48 
9188      Valid      3/16     01/16/17:12:57:48 
9188      Valid      4/8      01/16/17:12:57:48 
9188      Valid      5/17     01/16/17:12:57:48 
8672      Valid      2/15     01/16/17:12:57:48 
8672      Valid      3/15     01/16/17:12:57:48 
8672      Valid      4/7      01/16/17:12:57:48 
8672      Valid      5/15     01/16/17:12:57:48 
8156      Valid      2/14     01/16/17:12:57:48 
8156      Valid      3/14     01/16/17:12:57:48 
8156      Valid      4/6      01/16/17:12:57:48 
8156      Valid      5/13     01/16/17:12:57:48 
7640      Valid      2/13     01/16/17:12:57:47 
7640      Valid      3/13     01/16/17:12:57:47 
7640      Valid      4/5      01/16/17:12:57:47 
7640      Valid      5/11     01/16/17:12:57:47 
7096      Valid      2/12     01/16/17:12:57:47 
7096      Valid      3/11     01/16/17:12:57:47 
7096      Valid      4/4      01/16/17:12:57:47 
7096      Valid      5/9      01/16/17:12:57:47 
6580      Valid      2/11     01/16/17:12:57:46 
6580      Valid      3/10     01/16/17:12:57:46 
6580      Valid      4/3      01/16/17:12:57:46 
6580      Valid      5/7      01/16/17:12:57:46 
6580      Valid      6/2      01/16/17:12:57:46 
6580      Valid      7/2      01/16/17:12:57:46 
5880      Valid      2/10     01/16/17:12:57:46 
5880      Valid      3/9      01/16/17:12:57:46 
5880      Valid      5/5      01/16/17:12:57:46 
5880      Valid      7/1      01/16/17:12:57:46 
5392      Valid      7/0      01/16/17:12:57:46 DataRecord Object Space Creation
5140      Valid      2/9      01/16/17:12:57:46 
5140      Valid      3/8      01/16/17:12:57:46 
5140      Valid      5/4      01/16/17:12:57:46 
5140      Valid      6/1      01/16/17:12:57:46 
4656      Valid      6/0      01/16/17:12:57:46 DataFeed Object Space Creation
4412      Valid      2/8      01/16/17:12:57:46 
4412      Valid      3/7      01/16/17:12:57:46 
4412      Valid      4/2      01/16/17:12:57:46 
4412      Valid      5/3      01/16/17:12:57:46 
3904      Valid      2/7      01/16/17:12:57:45 
3904      Valid      3/6      01/16/17:12:57:45 
3904      Valid      5/1      01/16/17:12:57:45 
3516      Valid      5/0      01/16/17:12:57:45 Schema Object Space Creation
3276      Valid      2/6      01/16/17:12:57:45 
3276      Valid      3/5      01/16/17:12:57:45 
2984      Valid      2/5      01/16/17:12:57:45 
2984      Valid      3/4      01/16/17:12:57:45 
2984      Valid      4/1      01/16/17:12:57:45 
2600      Valid      4/0      01/16/17:12:57:45 DDMS Object Space Creation
2368      Valid      2/4      01/16/17:12:57:45 
2368      Valid      3/3      01/16/17:12:57:45 
2052      Valid      2/3      01/16/17:12:57:45 
1856      Valid      2/2      01/16/17:12:57:44 
1856      Valid      3/1      01/16/17:12:57:44 
1568      Valid      3/0      01/16/17:12:57:44 
1372      Valid      2/1      01/16/17:12:57:44 
1180      Valid      2/0      01/16/17:12:57:44 
988       Valid      1/1      01/16/17:12:57:44 
800       Valid      1/0      01/16/17:12:57:44 

...  running full compaction
V> V> 
+++  Compaction Statistics For Space 3:
     Time Now: 01/16/2017:12:57:52
     Unaccessed Container Count For Space 3: 79328
      1        8140     8868      364        8868         364
      2       -2764    10968    10936       19836       11300
      3     -163092   299944   230136      319780      241436
      4     -120632    43276      408      363056      241844
      5      -73960    78120    15724      441176      257568
      6      -17680    64320     4020      505496      261588
      7       17352    84624    24796      590120      286384
      8       67152    50312      256      640432      286640
      9      115272    50400     1140      690832      287780
     10       72240   198960   120996      889792      408776
     11      -94620   373268   270064     1263060      678840
     12     -113060    18504    18472     1281564      697312
     13     -946084  1424752  1128888     2706316     1826200
     14    -1074388   810656   469480     3516972     2295680
     15     -832192   437452    97628     3954424     2393308
     16     -836688   847064   425780     4801488     2819088
     17     -443812   420564    13844     5222052     2832932
     18     -512284    68536    68504     5290588     2901436
     19     -225128   586868   149856     5877456     3051292
     20      178532   455004    25672     6332460     3076964
     21      560484   498664    58356     6831124     3135320
     22      545076    15472    15440     6846596     3150760
     23      142032  1544396   973720     8390992     4124480
     24      225648  1194464   555424     9585456     4679904
    MSS = 22 [Reclaimed =      6831124, Copied =      3135320]

+++  Compaction Statistics For Space 2:
     Time Now: 01/16/2017:12:57:52
     Unaccessed Container Count For Space 2: 26337
      1        7524    28388    10432       28388       10432
      2       15736     8300       44       36688       10476
      3     -900476  1422284  1169248     1458972     1179724
      4     -698504   211396     4712     1670368     1184436
      5     -510732   189332      780     1859700     1185216
      6     -314136   197748      576     2057448     1185792
      7     -125644   210564    11036     2268012     1196828
      8       85408   281412    35180     2549424     1232008
      9      281644   197940      852     2747364     1232860
     10      477544   197940     1020     2945304     1233880
     11      695416   225240     3684     3170544     1237564
     12      897360   233160    15608     3403704     1253172
     13     1100356   216188     6596     3619892     1259768
     14     1308568   211188     1488     3831080     1261256
     15     1389400   375248   147208     4206328     1408464
     16     1605916   240236    11860     4446564     1420324
     17     1819544   214420      396     4660984     1420720
     18     2046284   227932      596     4888916     1421316
     19     2258988   214728     1012     5103644     1422328
     20     2486384   228188      396     5331832     1422724
     21     2686512   242368    21120     5574200     1443844
     22     2907508   221500      252     5795700     1444096
    MSS = 23 [Reclaimed =      5795700, Copied =      1444096]

+++  Compaction Statistics For Space 7:
     Time Now: 01/16/2017:12:57:52
     Unaccessed Container Count For Space 7: 50
      1        5520    11080     2780       11080        2780
      2       13732     8300       44       19380        2824
    MSS = 3 [Reclaimed =        19380, Copied =         2824]

+++  Compaction Statistics For Space 6:
     Time Now: 01/16/2017:12:57:52
     Unaccessed Container Count For Space 6: 2156
      1        6672    11048     2188       11048        2188
      2       14972     8300        0       19348        2188
      3      -66448   130700   106060      150048      108248
    MSS = 3 [Reclaimed =        19348, Copied =         2188]

+++  Compaction Statistics For Space 5:
     Time Now: 01/16/2017:12:57:52
     Unaccessed Container Count For Space 5: 32556
      1     -218556   335300   276928      335300      276928
      2     -539248   389308   355000      724608      631928
      3     -540312   557552   279308     1282160      911236
      4     -441864   102168     1860     1384328      913096
      5     -343372   102452     1980     1486780      915076
      6     -692072   425012   386856     1911792     1301932
      7     -532876   440828   140816     2352620     1442748
      8     -862428   702120   515836     3054740     1958584
      9     -757568   246356    70748     3301096     2029332
     10    -1294636  1041100   789084     4342196     2818416
     11    -1237180   391208   166876     4733404     2985292
     12    -1800432  1169988   866620     5903392     3851912
     13    -1663388   355212   109084     6258604     3960996
     14    -2348504  1258052   971584     7516656     4932580
     15    -2169076   334612    77592     7851268     5010172
     16    -2923072  1380028  1067012     9231296     6077184
     17    -2839956   494476   205680     9725772     6282864
     18    -3998804  1406712  1282780    11132484     7565644
     19    -3937420   438304   188460    11570788     7754104
     20    -3718676   309232    45244    11880020     7799348
     21    -3914576  1857732  1026816    13737752     8826164
     22    -3754728   482904   161528    14220656     8987692
     23    -3895020  1899124  1019708    16119780    10007400
     24    -3643764   364264    56504    16484044    10063904
     25    -3712996  2296872  1183052    18780916    11246956
     26    -3630588   474856   196224    19255772    11443180
     27    -6126020  2495496  2495464    21751268    13938644
     28    -5933696   332092    69884    22083360    14008528
    MSS = 1 [Reclaimed =            0, Copied =            0]

+++  Compaction Statistics For Space 4:
     Time Now: 01/16/2017:12:57:52
     Unaccessed Container Count For Space 4: 53
      1        6628    10732     2052       10732        2052
      2       14088     9140      840       19872        2892
      3       22388     8300        0       28172        2892
      4       30688     8300        0       36472        2892
      5       38988     8300        0       44772        2892
      6       47288     8300        0       53072        2892
      7       55588     8300        0       61372        2892
      8       63888     8300        0       69672        2892
      9       72188     8300        0       77972        2892
     10       80488     8300        0       86272        2892
     11       88700     8300       44       94572        2936
    MSS = 12 [Reclaimed =        94572, Copied =         2936]

+++  Compaction Statistics For Space 1:
     Time Now: 01/16/2017:12:57:52
     Unaccessed Container Count For Space 1: 1
      1          64       96       16          96          16
    MSS = 2 [Reclaimed =           96, Copied =           16]
>>> Object Network Updated <<<

V> V> Considering: 1
Processing: 1, MSS: 2
Considering: 2
Processing: 2, MSS: 23
Considering: 3
Processing: 3, MSS: 22
Considering: 4
Processing: 4, MSS: 12
Considering: 5
Processing: 5, MSS: 1
Considering: 6
Processing: 6, MSS: 3
Considering: 7
Processing: 7, MSS: 3
Considering: boot.log
Considering: NDF
Considering: NDF.ERRORS
Considering: NDF.GURL
Considering: NDF.JOURNAL
Considering: NDF.UUID
Processing: 1/.dsegs
Processing: 2/.dsegs
Processing: 3/.dsegs
Processing: 4/.dsegs
Processing: 5/.dsegs
Processing: 6/.dsegs
Processing: 7/.dsegs
--->  End of Compaction
Mon Jan 16 12:57:52 EST 2017

---> Running AdminTools objectSpaceProfile
Mon Jan 16 12:57:52 EST 2017
V> V> Profile of Network
  Total Size (in bytes):                     21,410,488
  Number of Containers:                         140,858

======================================================================

BuiltInWorkspace  -  Profile of ObjectSpace   1:

  Total Size (in bytes):                             64
        (containers > 10,000):                        0
        (containers < 10,000):                       64
  Number of Containers:                               2
         (containers > 10,000):                       0
         (containers < 10,000):                       2
  Unused Container Table Slots:                       0

  Type         Count         Total     %         Max         Min     Average      Median

PCTable            1            48  75.0          48          48          48          48
INA                1            16  25.0          16          16          16          16

======================================================================

BuiltInWorkspace  -  Profile of ObjectSpace   2:

  Total Size (in bytes):                      1,665,932
        (containers > 10,000):                  221,216
        (containers < 10,000):                1,444,716
  Number of Containers:                          26,700
         (containers > 10,000):                       1
         (containers < 10,000):                  26,699
  Unused Container Table Slots:                     948

  Type         Count         Total     %         Max         Min     Average      Median

PCTable            1       221,216  13.3     221,216     221,216     221,216     221,216
IArray             1           336   0.0         336         336         336         336
PToken        10,656       319,280  19.2          36          28          30          28
  Shift        2,614
  Cartesian        0
Link           1,806        70,760   4.2          84          36          39          36
Char           1,766       106,856   6.4       7,028          40          61          40
Double             3           156   0.0          52          52          52          52
Float              3           132   0.0          44          44          44          44
Integer          201        10,540   0.6         252          40          52          44
Pointer        2,375       108,772   6.5         100          40          46          44
Selector       1,765        82,712   5.0       1,772          40          47          40
Undefined         87         3,132   0.2          36          36          36          36
Block          1,721       218,440  13.1       6,228          60         127         104
Method           853        23,884   1.4          28          28          28          28
Context            3            96   0.0          32          32          32          32
Closure            4           112   0.0          28          28          28          28
Property       3,606       425,028  25.5       5,992         104         118         104
List               9           360   0.0          40          40          40          40
  SStore           1            40   0.0          40          40          40          40
  LStore           8           320   0.0          40          40          40          40
Table             53         2,536   0.2          96          44          48          44
Index              6           216   0.0          36          36          36          36
  TimeS            5
  IList            1
Descriptor        16           768   0.0          48          48          48          48
Dictionary     1,765        70,600   4.2          40          40          40          40

======================================================================

CoreWorkspace  -  Profile of ObjectSpace   3:

  Total Size (in bytes):                      5,318,920
        (containers > 10,000):                  752,360
        (containers < 10,000):                4,566,560
  Number of Containers:                          79,340
         (containers > 10,000):                       5
         (containers < 10,000):                  79,335
  Unused Container Table Slots:                     532

  Type         Count         Total     %         Max         Min     Average      Median

PCTable            1       639,008  12.0     639,008     639,008     639,008     639,008
PToken        29,201       852,748  16.0          44          28          29          28
  Shift        4,387
  Cartesian        0
Link           6,057       233,460   4.4         116          36          39          36
Char           5,848       306,532   5.8       2,572          40          52          40
Double             7           412   0.0          84          52          59          52
Integer          605        38,536   0.7         564          40          64          44
Pointer        5,635       265,560   5.0         564          40          47          44
Selector       5,738       252,260   4.7         568          40          44          40
Undefined        395        14,220   0.3          36          36          36          36
Block          5,599     1,009,944  19.0      68,504          60         180         116
Method         1,365        38,220   0.7          28          28          28          28
Context           10           320   0.0          32          32          32          32
Closure           20           560   0.0          28          28          28          28
Property      12,295     1,398,084  26.3       2,904         104         114         104
List             288        12,436   0.2         236          40          43          40
  SStore         110         4,716   0.1         236          40          43          40
  LStore         178         7,720   0.1         156          40          43          40
Table            395        21,500   0.4         112          44          54          44
Index            108         3,888   0.1          36          36          36          36
  TimeS            9
  IList           99
Descriptor        31         1,488   0.0          48          48          48          48
Dictionary     5,738       229,520   4.3          40          40          40          40
Uns64              2           104   0.0          52          52          52          52
Uns96              2           120   0.0          60          60          60          60

======================================================================

Environment DBA DDMS  -  Profile of ObjectSpace   4:

  Total Size (in bytes):                         11,160
        (containers > 10,000):                        0
        (containers < 10,000):                   11,160
  Number of Containers:                              54
         (containers > 10,000):                       0
         (containers < 10,000):                      54
  Unused Container Table Slots:                     970

  Type         Count         Total     %         Max         Min     Average      Median

PCTable            1         8,224  73.7       8,224       8,224       8,224       8,224
PToken            22           640   5.7          36          28          29          28
  Shift            3
  Cartesian        0
Link               4           168   1.5          44          36          42          44
Char               2           192   1.7         132          60          96          96
Integer            3           136   1.2          48          44          45          44
Pointer            8           352   3.2          44          44          44          44
Selector           1            76   0.7          76          76          76          76
Block              1           320   2.9         320         320         320         320
Method             1            28   0.3          28          28          28          28
Property           5           740   6.6         288         104         148         116
List               1            40   0.4          40          40          40          40
  SStore           1            40   0.4          40          40          40          40
  LStore           0           NA    NA          NA          NA          NA          NA 
Table              3           156   1.4          64          44          52          48
Descriptor         1            48   0.4          48          48          48          48
Dictionary         1            40   0.4          40          40          40          40

======================================================================

Environment DBA Schema  -  Profile of ObjectSpace   5:

  Total Size (in bytes):                     14,270,704
        (containers > 10,000):               12,242,008
        (containers < 10,000):                2,028,696
  Number of Containers:                          32,557
         (containers > 10,000):                     166
         (containers < 10,000):                  32,391
  Unused Container Table Slots:                     211

  Type         Count         Total     %         Max         Min     Average      Median

PCTable            1       262,176   1.8     262,176     262,176     262,176     262,176
PToken        25,873       970,052   6.8       1,324          28          37          36
  Shift       21,447
  Cartesian        0
Link             461        17,884   0.1         116          36          39          36
Char           1,081    10,286,800  72.1     620,760          40       9,516          40
Double             3           212   0.0         108          52          71          52
Float              1            44   0.0          44          44          44          44
Integer           86        74,120   0.5      20,764          44         862          44
Pointer        1,614     1,177,760   8.3      22,392          44         730          44
Selector         440        41,556   0.3      22,396          40          94          40
Undefined         82         2,952   0.0          36          36          36          36
Block            438       350,000   2.5     118,140          64         799         116
Method           153         4,284   0.0          28          28          28          28
Context           46         1,472   0.0          32          32          32          32
Closure           46         1,288   0.0          28          28          28          28
Property         972       172,020   1.2      13,448         104         177         104
List             647       881,924   6.2      20,760          36       1,363          36
  SStore         641       826,540   5.8      20,760          36       1,289          36
  LStore           6        55,384   0.4      20,760         808       9,231       6,124
Table             26         1,560   0.0         132          44          60          52
Index              6           216   0.0          36          36          36          36
  TimeS            1
  IList            5
Descriptor       139         6,672   0.0          48          48          48          48
Dictionary       440        17,600   0.1          40          40          40          40
Uns64              1            52   0.0          52          52          52          52
Uns96              1            60   0.0          60          60          60          60

======================================================================

Environment DBA DataFeed  -  Profile of ObjectSpace   6:

  Total Size (in bytes):                        132,856
        (containers > 10,000):                   24,608
        (containers < 10,000):                  108,248
  Number of Containers:                           2,157
         (containers > 10,000):                       1
         (containers < 10,000):                   2,156
  Unused Container Table Slots:                     915

  Type         Count         Total     %         Max         Min     Average      Median

PCTable            1        24,608  18.5      24,608      24,608      24,608      24,608
PToken           938        27,432  20.6          36          28          29          28
  Shift          146
  Cartesian        0
Link             142         6,472   4.9         100          36          46          44
Char              25         9,552   7.2       1,036          64         382         368
Integer           66         2,980   2.2          64          44          45          44
Pointer          398        18,048  13.6         100          44          45          44
Selector          24         2,972   2.2         248          68         124         124
Undefined         57         2,052   1.5          36          36          36          36
Block              1           280   0.2         280         280         280         280
Method           194         5,432   4.1          28          28          28          28
Context            2            64   0.0          32          32          32          32
Closure            2            56   0.0          28          28          28          28
Property         105        23,432  17.6       1,384         104         223         116
List              30         1,200   0.9          40          40          40          40
  SStore           1            40   0.0          40          40          40          40
  LStore          29         1,160   0.9          40          40          40          40
Table            141         6,980   5.3          76          44          50          44
Descriptor         7           336   0.3          48          48          48          48
Dictionary        24           960   0.7          40          40          40          40

======================================================================

Environment DBA DataRecordClasses  -  Profile of ObjectSpace   7:

  Total Size (in bytes):                         11,048
        (containers > 10,000):                        0
        (containers < 10,000):                   11,048
  Number of Containers:                              51
         (containers > 10,000):                       0
         (containers < 10,000):                      51
  Unused Container Table Slots:                     973

  Type         Count         Total     %         Max         Min     Average      Median

PCTable            1         8,224  74.4       8,224       8,224       8,224       8,224
PToken            19           532   4.8          28          28          28          28
  Shift            0
  Cartesian        0
Link               4           168   1.5          44          36          42          44
Char               2           204   1.8         132          72         102         102
Integer            3           136   1.2          48          44          45          44
Pointer            8           352   3.2          44          44          44          44
Selector           1            76   0.7          76          76          76          76
Block              1           304   2.8         304         304         304         304
Method             1            28   0.3          28          28          28          28
Property           5           740   6.7         288         104         148         116
List               1            40   0.4          40          40          40          40
  SStore           1            40   0.4          40          40          40          40
  LStore           0           NA    NA          NA          NA          NA          NA 
Table              3           156   1.4          64          44          52          48
Descriptor         1            48   0.4          48          48          48          48
Dictionary         1            40   0.4          40          40          40          40

V> --->  Setting network directory permissions
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%    Install InvestCore Bootstrap    %%%
Running /home/mikey/vision-open-source/software/builds/current/bin/batchvision with scripts from /home/mikey/vision-open-source/application/localvision/bootstrap/protocol/originals in /home/mikey/vision-open-source/application/localvision/bootstrap/investNet/NDF
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
 
 
        ***  Installing Investment Core Spaces  ***
Mon Jan 16 12:57:53 EST 2017
 
V> V> V> V> V> V> ...  Creating Space #8  
 For: Storage for Security Properties
>>> Object Space 8 Created <<<
>>> Object Network Updated <<<

V> V> V> V> V> V> V> ...  Creating Space #9  
 For: Storage for Company Properties
>>> Object Space 9 Created <<<
>>> Object Network Updated <<<

V> V> V> V> V> V> V> ...  Creating Space #10 
 For: Storage for Account Properties
>>> Object Space 10 Created <<<
>>> Object Network Updated <<<

V>  
        ***  End Of Investment Core Object Spaces  ***
Mon Jan 16 12:57:53 EST 2017
---> Install Investment Core: Classes Creation
Mon Jan 16 12:57:53 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> >>> Object Network Updated <<<

V> V> ---> Install Investment Core: Protocol
Mon Jan 16 12:57:54 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> >>> Object Network Updated <<<

V> V> ---> Install Investment Core: dbs driver support
Mon Jan 16 12:57:55 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> >>> Object Network Updated <<<

V> V> ---> Install Investment Core: data feed support
Mon Jan 16 12:57:55 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> 

                    ---  Begin Reconcile for ClassSetup  ---                    

  Upload Feed:   ClassSetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new subclasses created. 
EstimateRecordFeed EntityExtenderFeed EstimateRecord feeds are a special case of EntityExtender that initialize and update EstimateBridge-EstimateRecord data.


                     ---  End Reconcile for ClassSetup  ---                     



Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:52 EST 2017
---  Current Counts  ---
CD:             232
MD:            2861
MID:           5216

---  Classes To Update  ---
Object
CoreWorkspace
Environment DBA DataFeed
DataFeed
DataSet
DataRecord
EstimateBridge
EstimateRecord
AnalystEstimateRecord
ConsensusEstimateRecord
SummaryEstimateBridge
DetailEstimateBridge
ClassSetup
Environment DBA SecurityClass
Environment DBA CompanyClass
Environment DBA AccountClass
Security
Company
Account
Portfolio
AggAccount
IndexAccount
CompositeAccount
Country
Industry
Sector
SecurityType
AssetCategory
Analyst
Broker
Frequency
DataSeries
DataType
Holding
CompositeAccount Component
DivRecord
PriceRecord
MiscTools
MiscTools TSGenerator
PriceTools
PriceTools PriceTSGenerator
Security XRef
Company XRef
SecurityMaster
ExchangeRateFeed
SplitsFeed
PriceFeed
IndexAccountBuilder
CompanyToCountry
PortfolioAggregates
CompositeAccountMembers
HoldingsFeed
EstimateRecordFeed

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:55 EST 2017
---  Current Counts  ---
CD:             232
MD:            3150
MID:           6013

      797 Created.
      869 Refreshed.

V> V> V> >>> Object Network Updated <<<

V> V> ---> Install Investment Core: data feed inst and doc
Mon Jan 16 12:57:55 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> 

                    ---  Begin Reconcile for ClassSetup  ---                    

  Upload Feed:   ClassSetup
  Total Records:        25
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                     ---  End Reconcile for ClassSetup  ---                     





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:        48
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:         11

       11 new properties created. 
Company analyst (TS)       NA  Analyst  (xref companyList)  
DataItem defaultDecimals (FP ) Integer 2  
DataItem defaultWidth (FP ) Integer 9  
DataItem profileLink (FP )       NA        NA   
DataItem showAvg (FP )       NA  TRUE  
DataItem showHMean (FP )       NA  FALSE  
DataItem showMed (FP )       NA  TRUE  
DataItem showTot (FP )       NA  FALSE  
DataItem showWtAvg (FP )       NA  FALSE  
Security latestMarketCapUS (FP ) Double       NA   latest mcap available (in US$)
SecurityType assetCategory (FP )       NA  AssetCategory  asset category for type


                   ---  End Reconcile for PropertySetup  ---                    





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:        13
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:         13

       13 new properties created. 
ConsensusEstimateRecord _highEst (FP ) Double       NA  CURRENCY PERSHARE 
ConsensusEstimateRecord _lowEst (FP ) Double       NA  CURRENCY PERSHARE 
ConsensusEstimateRecord _meanEst (FP ) Double       NA  CURRENCY PERSHARE 
ConsensusEstimateRecord _meanEstPrev (FP ) Double       NA  CURRENCY PERSHARE 
ConsensusEstimateRecord _medianEst (FP ) Double       NA  CURRENCY PERSHARE 
ConsensusEstimateRecord _medianEstPrev (FP ) Double       NA  CURRENCY PERSHARE 
ConsensusEstimateRecord _naiveEst (FP ) Double       NA  CURRENCY PERSHARE 
ConsensusEstimateRecord numberDown (FP ) Integer       NA   
ConsensusEstimateRecord numberOfEstimates (FP ) Integer       NA   
ConsensusEstimateRecord numberUp (FP ) Integer       NA   
ConsensusEstimateRecord pe (FP ) Double       NA   
ConsensusEstimateRecord pePrev (FP ) Double       NA   
ConsensusEstimateRecord stdDev (FP ) Double       NA   


                   ---  End Reconcile for PropertySetup  ---                    





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
Company _primaryCompany (FP ) Company       NA   


                   ---  End Reconcile for PropertySetup  ---                    





                   ---  Begin Reconcile for MessageSetup  ---                   

  Upload Feed:   MessageSetup
  Total Records:       126
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for MessageSetup  ---                    





                   ---  Begin Reconcile for MessageSetup  ---                   

  Upload Feed:   MessageSetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for MessageSetup  ---                    





                   ---  Begin Reconcile for MessageSetup  ---                   

  Upload Feed:   MessageSetup
  Total Records:        17
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for MessageSetup  ---                    





                   ---  Begin Reconcile for MessageSetup  ---                   

  Upload Feed:   MessageSetup
  Total Records:         2
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for MessageSetup  ---                    





                 ---  Begin Reconcile for MasterFeedSetup  ---                  

  Upload Feed:   MasterFeedSetup
  Total Records:        17
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

       14 new feed subclasses created. 
AggAccountMaster (MasterFeed) AggAccount
AnalystMaster (MasterFeed) Analyst
AssetCatMaster (MasterFeed) AssetCategory
CompanyMaster (MasterFeed) Company
CompositeAccountMaster (MasterFeed) CompositeAccount
CountryMaster (MasterFeed) Country
DataAccessPathFeed (MasterFeed) DataAccessPath
DataItemFeed (MasterFeed) DataItem
IdSourceMaster (MasterFeed) IdSource
IndexAccountMaster (MasterFeed) IndexAccount
IndustryMaster (MasterFeed) Industry
PortfolioMaster (MasterFeed) Portfolio
SectorMaster (MasterFeed) Sector
SecurityTypeMaster (MasterFeed) SecurityType


                  ---  End Reconcile for MasterFeedSetup  ---                   





             ---  Begin Reconcile for EntityExtenderFeedSetup  ---              

  Upload Feed:   EntityExtenderFeedSetup
  Total Records:         5
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

        1 new feed subclasses created. 
DivFeed (EntityExtenderFeed)  DivRecord for Security  freq:       NA 


        1 Missing Link From Entity to DataRecord.
feedId              Entity Class        DataRecord Class
PriceFeed           Security            PriceRecord


              ---  End Reconcile for EntityExtenderFeedSetup  ---               





               ---  Begin Reconcile for MembershipFeedSetup  ---                

  Upload Feed:   MembershipFeedSetup
  Total Records:         7
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

        3 new feed subclasses created. 
CompanyToAnalyst (MembershipFeed) Analyst companyList Company analyst 
CompanyToIndustry (MembershipFeed) Industry memberList Company industry 
IndustryToSector (MembershipFeed) Sector memberList Industry sector 


                ---  End Reconcile for MembershipFeedSetup  ---                 





               ---  Begin Reconcile for TransactionFeedSetup  ---               

  Upload Feed:   TransactionFeedSetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                ---  End Reconcile for TransactionFeedSetup  ---                





                  ---  Begin Reconcile for AliasFeedSetup  ---                  

  Upload Feed:   AliasFeedSetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

        1 new feed subclasses created. 
SecurityAliases (AliasFeed) Security


                   ---  End Reconcile for AliasFeedSetup  ---                   





                  ---  Begin Reconcile for XRefFeedSetup  ---                   

  Upload Feed:   XRefFeedSetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

        1 new feed subclasses created. 
SecurityXRef (XRefFeed) Security


                   ---  End Reconcile for XRefFeedSetup  ---                    





                ---  Begin Reconcile for SecurityTypeMaster  ---                

  Upload Feed:   SecurityTypeMaster
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new SecurityType instances created. 
Cash                Cash                                         


                 ---  End Reconcile for SecurityTypeMaster  ---                 





                  ---  Begin Reconcile for SecurityMaster  ---                  

  Upload Feed:   SecurityMaster
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

...  Rebuilding Company Cusip6 Cross Reference.
...  Rebuilding Company -> Security Cross Reference.


                   ---  End Reconcile for SecurityMaster  ---                   





                  ---  Begin Reconcile for IdSourceMaster  ---                  

  Upload Feed:   IdSourceMaster
  Total Records:         7
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          7

        7 new IdSource instances created. 
Internal            Internal                                     
CUSIP               Cusip                                        
SEDOL               Sedol                                        
TICKERUS            Ticker Symbol (US only)                      
RIC                 Reuters                                      
ISIN                Isin                                         
VALOR               Valor                                        


                   ---  End Reconcile for IdSourceMaster  ---                   




V> V> V> V> V> V> >>> Object Network Updated <<<

V> V>  
 
        ***  Installing Historical Price Object Spaces  ***
Mon Jan 16 12:57:57 EST 2017
 
V> V> V> ...  Creating Space #11 
 For: EOM Price History Storage As Of 1
>>> Object Space 11 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #12 
 For: Annual Price History Storage As Of 1900
>>> Object Space 12 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #13 
 For: Annual Price History Storage As Of 2012
>>> Object Space 13 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #14 
 For: Annual Price History Storage As Of 2013
>>> Object Space 14 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #15 
 For: Annual Price History Storage As Of 2014
>>> Object Space 15 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #16 
 For: Annual Price History Storage As Of 2015
>>> Object Space 16 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #17 
 For: Annual Price History Storage As Of 2016
>>> Object Space 17 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #18 
 For: Annual Price History Storage As Of 2017
>>> Object Space 18 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #19 
 For: Annual Price History Storage As Of 2018
>>> Object Space 19 Created <<<
>>> Object Network Updated <<<

V> V> V> V> ...  Creating Space #20 
 For: Annual Price History Storage As Of 2019
>>> Object Space 20 Created <<<
>>> Object Network Updated <<<

V>  
        ***  End Of Historical Price Object Spaces  ***
Mon Jan 16 12:57:59 EST 2017
 
 
        ***  Installing Historical Holding Object Spaces  ***
Mon Jan 16 12:57:59 EST 2017
 
V> V> V> V> V> V> V> V> ...  Creating Space #21 
 For: Holdings Data As Of 1/1/1900
>>> Object Space 21 Created <<<
>>> Object Network Updated <<<

V> V> V> V> V> V> V> V> V> ...  Creating Space #22 
 For: Holdings Data As Of 1/1/2016
>>> Object Space 22 Created <<<
>>> Object Network Updated <<<

V> V> V> V> V> V> V> V> V> ...  Creating Space #23 
 For: Holdings Data As Of 1/1/2017
>>> Object Space 23 Created <<<
>>> Object Network Updated <<<

V> V> V> V> V> V> V> V> V> ...  Creating Space #24 
 For: Holdings Data As Of 1/1/2018
>>> Object Space 24 Created <<<
>>> Object Network Updated <<<

V> V> V> V> V> V> V> V> V> ...  Creating Space #25 
 For: Holdings Data As Of 1/1/2019
>>> Object Space 25 Created <<<
>>> Object Network Updated <<<

V>  
        ***  End Of Historical Holdings Object Spaces  ***
Mon Jan 16 12:58:00 EST 2017
---> Schema Update
Mon Jan 16 12:58:00 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> ***  Inheritance Map For Class: Object  ***

Object   <===== YOU ARE HERE
   Boolean
      FALSE
      TRUE
   Bridge
      EstimateBridge
         DetailEstimateBridge
         SummaryEstimateBridge
      LocalEntity
   BuiltInWorkspace
      CoreWorkspace
         Environment DB DailyPrice1900
         Environment DB DailyPrice2012
         Environment DB DailyPrice2013
         Environment DB DailyPrice2014
         Environment DB DailyPrice2015
         Environment DB DailyPrice2016
         Environment DB DailyPrice2017
         Environment DB DailyPrice2018
         Environment DB DailyPrice2019
         Environment DB EOMPrice1
         Environment DB Holdings19000101
         Environment DB Holdings20160101
         Environment DB Holdings20170101
         Environment DB Holdings20180101
         Environment DB Holdings20190101
         Environment DBA AccountClass
         Environment DBA CompanyClass
         Environment DBA DDMS
         Environment DBA DataFeed
         Environment DBA DataRecordClasses
         Environment DBA Schema
         Environment DBA SecurityClass
   Catalog
      ApplicationCatalog
      EntityCatalog
   Chain
   Chain Link
   DBEntity
   DataRecord
      DivRecord
      EstimateRecord
         AnalystEstimateRecord
         ConsensusEstimateRecord
      PriceRecord
   DateRange
   Descriptor
      Date DayOfWeekDescriptor
      Date MonthDescriptor
   Dictionary
      AdminTools Named
      Environment
      Interface Named
      LayoutTools Named
      LocalDBDictionary
      Named
      SystemDictionary
      XRef
         Company XRef
         Currency XRef
         Security XRef
   Entity
      Account
         AggAccount
         CompositeAccount
         IndexAccount
         Portfolio
      Analyst
      Broker
      Classification
         AssetCategory
         Country
         Industry
         RangeClassification
         Sector
         SecurityType
      Company
      Currency
      DataSource
      Security
      Support
         DataAccessPath
         DataItem
         DataSeries
         DataType
         Frequency
         IdSource
      SystemTable
         ClassType
         FunctionType
         KeyType
         MessageType
         UpdateType
         UsageLevel
      Table
      Universe
      VendorEntity
   FixedProperty
      TimeSeriesProperty
   Function
      ComputedFunction
         Block
         Method
         Primitive
      EnumeratedFunction
         Collection
            IndexedCollection
               IndexedList
               TimeSeries
            SequencedCollection
               List
         Value
   IncorporatorPrototype
      DataFeed
         AliasFeed
            SecurityAliases
         EntityExtenderFeed
            DivFeed
            EstimateRecordFeed
            ExchangeRateFeed
            IndexAccountBuilder
            PriceFeed
            SplitsFeed
         GlobalsFeed
         MasterFeed
            AggAccountMaster
            AnalystMaster
            AssetCatMaster
            CompanyMaster
            CompositeAccountMaster
            CountryMaster
            CurrencyMaster
            DataAccessPathFeed
            DataItemFeed
            IdSourceMaster
            IndexAccountMaster
            IndustryMaster
            PortfolioMaster
            SectorMaster
            SecurityMaster
            SecurityTypeMaster
            UniverseMaster
         MembershipFeed
            CompanyToAnalyst
            CompanyToCountry
            CompanyToIndustry
            CompositeAccountMembers
            IndustryToSector
            PortfolioAggregates
            UniverseMembers
         RangeGroupFeed
         SchemaFeeds
            ClassSetup
            DataFeedSetup
               AliasFeedSetup
               EntityExtenderFeedSetup
               MasterFeedSetup
               MembershipFeedSetup
               RangeGroupFeedSetup
               TransactionFeedSetup
               XRefFeedSetup
            MessageSetup
            PropertySetup
         TransactionFeed
            HoldingsFeed
         XRefFeed
            SecurityXRef
      DataSet
   LinkRecord
      CompositeAccount Component
      Holding
   Matrix
   Ordinal
      Character
      Date
      DateOffset
         BusinessDays
         Days
         MonthBeginnings
         MonthEnds
         Months
         QuarterBeginnings
         QuarterEnds
         Quarters
         YearBeginnings
         YearEnds
         Years
      Number
         Double
         Float
         Integer
      String
      Time
         HighResolutionTime
         LowResolutionTime
   PrivateRecord
   Selector
   Specification
   ToolKit
      AdminTools
         AdminTools ClusterType
         AdminTools ObjectSpace
         AdminTools _POP
      Environment MaintenanceTools
      FormatToolProtocol
         FormatToolProtocol Html
      Interface
         Interface Constant
         Interface ErrorLog
         Interface External
            Interface ExternalFeedManager
               Interface BatchFeedManager
               Interface DBAdminManager
               Interface ExcelManager
               Interface SqlManager
            Interface HtmlAccess
         Interface Global
         Interface Workspace
            Interface ApplicationWS
            Interface ExtractWS
      LayoutTools
         LayoutTools Component
            LayoutTools Barchart DataSet
            LayoutTools FormSpec InputSpec
            LayoutTools GraphSpec Axis
            LayoutTools GraphSpec Label
            LayoutTools Linechart DataSet
            LayoutTools Piechart Slice
            LayoutTools TableSpec ColumnSpec
            LayoutTools TableSpec Label
         LayoutTools Specification
            LayoutTools FormSpec
            LayoutTools GraphSpec
               LayoutTools Barchart
               LayoutTools Linechart
               LayoutTools Piechart
            LayoutTools TableSpec
      MiscTools
         MiscTools TSGenerator
            PriceTools PriceTSGenerator
      OpenVision
         OpenVision Channel
         OpenVision Constant
            OpenVision Channel ChannelType
            OpenVision Channel Error
            OpenVision Channel Option
            OpenVision Channel State
            OpenVision Channel Status
            OpenVision OptionValue
               OpenVision Channel BinaryFormat
               OpenVision Channel PromptFormat
               OpenVision Channel TrimFormat
      PriceTools
      PrinterTools
         PrinterTools Descriptor
      ProcessControlTools
         ProcessControlTools ExternalProgram
      Schema
         Schema Descriptor
            Schema ClassDescriptor
            Schema MessageDescriptor
            Schema MessageImplementationDescriptor
   Undefined
      NoValue
   UserEnvironment
   Utility
   Utility SessionAttribute
   Utility UnixSeconds

Schema Message Cross Reference Last Updated: Mon Jan 16 12:57:55 EST 2017
---  Current Counts  ---
CD:             267
MD:            3199
MID:           6066

---  Classes To Update  ---
Object
CoreWorkspace
Schema
Environment DBA DataFeed
DataFeed
DataItem
ConsensusEstimateRecord
ClassSetup
PropertySetup
MessageSetup
MasterFeedSetup
EntityExtenderFeedSetup
TransactionFeedSetup
MembershipFeedSetup
AliasFeedSetup
XRefFeedSetup
CurrencyMaster
UniverseMaster
UniverseMembers
Security
Company
SecurityType
Analyst
DivRecord
PriceRecord
SecurityMaster
ExchangeRateFeed
SplitsFeed
PriceFeed
IndexAccountBuilder
CompanyToCountry
PortfolioAggregates
CompositeAccountMembers
DataItemFeed
DataAccessPathFeed
IdSourceMaster
CompanyMaster
PortfolioMaster
AggAccountMaster
IndexAccountMaster
CompositeAccountMaster
IndustryMaster
SectorMaster
CountryMaster
SecurityTypeMaster
AssetCatMaster
AnalystMaster
DivFeed
CompanyToIndustry
IndustryToSector
CompanyToAnalyst
SecurityAliases
SecurityXRef
Environment DB EOMPrice1
Environment DB DailyPrice1900
Environment DB DailyPrice2012
Environment DB DailyPrice2013
Environment DB DailyPrice2014
Environment DB DailyPrice2015
Environment DB DailyPrice2016
Environment DB DailyPrice2017
Environment DB DailyPrice2018
Environment DB DailyPrice2019
Environment DB Holdings19000101
Environment DB Holdings20160101
Environment DB Holdings20170101
Environment DB Holdings20180101
Environment DB Holdings20190101

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:00 EST 2017
---  Current Counts  ---
CD:             267
MD:            3221
MID:           6583

      517 Created.
      570 Refreshed.
>>> Object Network Updated <<<

V> ---> Install Investment Core: run-time starter system
Mon Jan 16 12:58:00 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> V> V> V> V> V> ---> Loading Data File: ClassSetup.idemo for ClassSetup


                    ---  Begin Reconcile for ClassSetup  ---                    

  Upload Feed:   ClassSetup
  Total Records:         9
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          9

        9 new subclasses created. 
AnalystEstimate DataRecord ( 7 )This class stores estimate data for a company.
EconomicData DataRecord ( 7 )This class stores economic time series for a country.
FundamentalData DataRecord ( 7 )This class represents different frequencies of fundamental company data.
FundamentalDataA FundamentalData ( 7 )This class stores company annual fundamentals.
FundamentalDataM FundamentalData ( 7 )This class stores company monthly fundamentals.
FundamentalDataQ FundamentalData ( 7 )This class stores company quarterly fundamentals.
MCapGroup RangeClassification This class represents market cap ranges.
PBGroup RangeClassification This class represents price to book ranges.
PEGroup RangeClassification This class represents pe ranges.


                     ---  End Reconcile for ClassSetup  ---                     



---> Loading Data File: PropertySetup.idemo for PropertySetup


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:        99
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:         99

       99 new properties created. 
AnalystEstimate _q1Est (FP ) Double       NA  CURRENCY,PERSHARE 
AnalystEstimate _q2Est (FP ) Double       NA  CURRENCY,PERSHARE 
AnalystEstimate _q3Est (FP ) Double       NA  CURRENCY,PERSHARE 
AnalystEstimate _q4Est (FP ) Double       NA  CURRENCY,PERSHARE 
AnalystEstimate _y1Est (FP ) Double       NA  CURRENCY,PERSHARE 
AnalystEstimate _y2Est (FP ) Double       NA  CURRENCY,PERSHARE 
AnalystEstimate _y3Est (FP ) Double       NA  CURRENCY,PERSHARE 
AnalystEstimate analyst (FP )       NA  Analyst  
AnalystEstimate nextQuarterEnd (FP )       NA  Date  
AnalystEstimate nextYearEnd (FP )       NA  Date  
Company analystEsts (TS)       NA  AnalystEstimate  
Company funDataA (TS)       NA  FundamentalDataA  
Company funDataM (TS)       NA  FundamentalDataM  
Company funDataQ (TS)       NA  FundamentalDataQ  
Country econData (FP )       NA  EconomicData  
EconomicData cpi (TS) Double       NA   
EconomicData gnp (TS) Double       NA   
FundamentalDataA _assets (FP ) Double       NA  CURRENCY 
FundamentalDataA _assetsOther (FP ) Double       NA  CURRENCY 
FundamentalDataA _cash (FP ) Double       NA  CURRENCY 
FundamentalDataA _cogs (FP ) Double       NA  CURRENCY 
FundamentalDataA _commonEquity (FP ) Double       NA  CURRENCY 
FundamentalDataA _curAssets (FP ) Double       NA  CURRENCY 
FundamentalDataA _curAssetsOther (FP ) Double       NA  CURRENCY 
FundamentalDataA _curLiab (FP ) Double       NA  CURRENCY 
FundamentalDataA _curLiabOther (FP ) Double       NA  CURRENCY 
FundamentalDataA _debtCurLiab (FP ) Double       NA  CURRENCY 
FundamentalDataA _defTax (FP ) Double       NA  CURRENCY 
FundamentalDataA _deprecAmort (FP ) Double       NA  CURRENCY 
FundamentalDataA _income (FP ) Double       NA  CURRENCY 
FundamentalDataA _incomeTax (FP ) Double       NA  CURRENCY 
FundamentalDataA _intExp (FP ) Double       NA  CURRENCY 
FundamentalDataA _intang (FP ) Double       NA  CURRENCY 
FundamentalDataA _inventory (FP ) Double       NA  CURRENCY 
FundamentalDataA _investAndAdvEquity (FP ) Double       NA  CURRENCY 
FundamentalDataA _investAndAdvOther (FP ) Double       NA  CURRENCY 
FundamentalDataA _liab (FP ) Double       NA  CURRENCY 
FundamentalDataA _liabOther (FP ) Double       NA  CURRENCY 
FundamentalDataA _ltDebt (FP ) Double       NA  CURRENCY 
FundamentalDataA _minorInt (FP ) Double       NA  CURRENCY 
FundamentalDataA _minorIntBS (FP ) Double       NA  CURRENCY 
FundamentalDataA _netIncome (FP ) Double       NA  CURRENCY 
FundamentalDataA _nonOpIncome (FP ) Double       NA  CURRENCY 
FundamentalDataA _opIncome (FP ) Double       NA  CURRENCY 
FundamentalDataA _payables (FP ) Double       NA  CURRENCY 
FundamentalDataA _ppeNet (FP ) Double       NA  CURRENCY 
FundamentalDataA _prefStockCV (FP ) Double       NA  CURRENCY 
FundamentalDataA _pretaxIncome (FP ) Double       NA  CURRENCY 
FundamentalDataA _receivables (FP ) Double       NA  CURRENCY 
FundamentalDataA _sales (FP ) Double       NA  CURRENCY 
FundamentalDataA _sga (FP ) Double       NA  CURRENCY 
FundamentalDataA _specialItems (FP ) Double       NA  CURRENCY 
FundamentalDataA _stockhEquity (FP ) Double       NA  CURRENCY 
FundamentalDataA _taxesPayable (FP ) Double       NA  CURRENCY 
FundamentalDataM _bookValue (FP ) Double       NA  PERSHARE,CURRENCY 
FundamentalDataM _eps12 (FP ) Double       NA  PERSHARE,CURRENCY 
FundamentalDataM _epsOps12 (FP ) Double       NA  PERSHARE,CURRENCY 
FundamentalDataM _marketCap (FP ) Double       NA  CURRENCY 
FundamentalDataM _price (FP ) Double       NA  PERSHARE,CURRENCY 
FundamentalDataM _sharesOut (FP ) Double       NA  SHARES 
FundamentalDataM pe (FP ) Double       NA   
FundamentalDataM priceToBook (FP ) Double       NA   
FundamentalDataM return1m (FP ) Double       NA   
FundamentalDataQ _assets (FP ) Double       NA  CURRENCY 
FundamentalDataQ _assetsOther (FP ) Double       NA  CURRENCY 
FundamentalDataQ _cash (FP ) Double       NA  CURRENCY 
FundamentalDataQ _cogs (FP ) Double       NA  CURRENCY 
FundamentalDataQ _commonEquity (FP ) Double       NA  CURRENCY 
FundamentalDataQ _curAssets (FP ) Double       NA  CURRENCY 
FundamentalDataQ _curAssetsOther (FP ) Double       NA  CURRENCY 
FundamentalDataQ _curLiab (FP ) Double       NA  CURRENCY 
FundamentalDataQ _curLiabOther (FP ) Double       NA  CURRENCY 
FundamentalDataQ _debtCurLiab (FP ) Double       NA  CURRENCY 
FundamentalDataQ _defTax (FP ) Double       NA  CURRENCY 
FundamentalDataQ _deprecAmort (FP ) Double       NA  CURRENCY 
FundamentalDataQ _income (FP ) Double       NA  CURRENCY 
FundamentalDataQ _incomeTax (FP ) Double       NA  CURRENCY 
FundamentalDataQ _intExp (FP ) Double       NA  CURRENCY 
FundamentalDataQ _inventory (FP ) Double       NA  CURRENCY 
FundamentalDataQ _liab (FP ) Double       NA  CURRENCY 
FundamentalDataQ _liabOther (FP ) Double       NA  CURRENCY 
FundamentalDataQ _ltDebt (FP ) Double       NA  CURRENCY 
FundamentalDataQ _minorInt (FP ) Double       NA  CURRENCY 
FundamentalDataQ _minorIntBS (FP ) Double       NA  CURRENCY 
FundamentalDataQ _netIncome (FP ) Double       NA  CURRENCY 
FundamentalDataQ _nonOpIncome (FP ) Double       NA  CURRENCY 
FundamentalDataQ _payables (FP ) Double       NA  CURRENCY 
FundamentalDataQ _ppeNet (FP ) Double       NA  CURRENCY 
FundamentalDataQ _prefStockCV (FP ) Double       NA  CURRENCY 
FundamentalDataQ _pretaxIncome (FP ) Double       NA  CURRENCY 
FundamentalDataQ _receivables (FP ) Double       NA  CURRENCY 
FundamentalDataQ _sales (FP ) Double       NA  CURRENCY 
FundamentalDataQ _sga (FP ) Double       NA  CURRENCY 
FundamentalDataQ _specialItems (FP ) Double       NA  CURRENCY 
FundamentalDataQ _stockhEquity (FP ) Double       NA  CURRENCY 
FundamentalDataQ _taxesPayable (FP ) Double       NA  CURRENCY 
Security marketCapGroup (FP )       NA  MCapGroup  market cap group
Security pbGroup (FP )       NA  PBGroup  price to book group
Security peGroup (FP )       NA  PEGroup  pe group


                   ---  End Reconcile for PropertySetup  ---                    



---> Loading Data File: MessageSetup.idemo for MessageSetup


                   ---  Begin Reconcile for MessageSetup  ---                   

  Upload Feed:   MessageSetup
  Total Records:         0
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for MessageSetup  ---                    



---> Loading Data File: MasterSetup.idemo for MasterFeedSetup


                 ---  Begin Reconcile for MasterFeedSetup  ---                  

  Upload Feed:   MasterFeedSetup
  Total Records:         0
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                  ---  End Reconcile for MasterFeedSetup  ---                   



---> Loading Data File: EntityExtenderSetup.idemo for EntityExtenderFeedSetup


             ---  Begin Reconcile for EntityExtenderFeedSetup  ---              

  Upload Feed:   EntityExtenderFeedSetup
  Total Records:         5
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

        5 new feed subclasses created. 
AnalystEst (EntityExtenderFeed)  AnalystEstimate for Company  freq:       NA 
EconFeed (EntityExtenderFeed)  EconomicData for Country  freq:       NA 
FundamentalA (EntityExtenderFeed)  FundamentalDataA for Company  freq:        12 MonthEnds
FundamentalM (EntityExtenderFeed)  FundamentalDataM for Company  freq:         1 MonthEnds
FundamentalQ (EntityExtenderFeed)  FundamentalDataQ for Company  freq:         3 MonthEnds



              ---  End Reconcile for EntityExtenderFeedSetup  ---               



---> Loading Data File: MembershipSetup.idemo for MembershipFeedSetup


               ---  Begin Reconcile for MembershipFeedSetup  ---                

  Upload Feed:   MembershipFeedSetup
  Total Records:         0
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                ---  End Reconcile for MembershipFeedSetup  ---                 



---> Loading Data File: TransactionSetup.idemo for TransactionFeedSetup


               ---  Begin Reconcile for TransactionFeedSetup  ---               

  Upload Feed:   TransactionFeedSetup
  Total Records:         0
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                ---  End Reconcile for TransactionFeedSetup  ---                



---> Loading Data File: AliasSetup.idemo for AliasFeedSetup


                  ---  Begin Reconcile for AliasFeedSetup  ---                  

  Upload Feed:   AliasFeedSetup
  Total Records:         0
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                   ---  End Reconcile for AliasFeedSetup  ---                   



---> Loading Data File: RangeGroupSetup.idemo for RangeGroupFeedSetup


               ---  Begin Reconcile for RangeGroupFeedSetup  ---                

  Upload Feed:   RangeGroupFeedSetup
  Total Records:         3
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

        3 new feed subclasses created. 
McapGroups (RangeGroupFeed) MCapGroup Security marketCapGroup marketCapUS
PbGroups (RangeGroupFeed) PBGroup Security pbGroup priceToBook
PeGroups (RangeGroupFeed) PEGroup Security peGroup pe


                ---  End Reconcile for RangeGroupFeedSetup  ---                 





                   ---  Begin Reconcile for MessageSetup  ---                   

  Upload Feed:   MessageSetup
  Total Records:         4
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for MessageSetup  ---                    





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         2
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          2

        2 new properties created. 
Company logoFile (FP )       NA        NA   
Company webSite (FP )       NA        NA   


                   ---  End Reconcile for PropertySetup  ---                    





                   ---  Begin Reconcile for DataItemFeed  ---                   

  Upload Feed:   DataItemFeed
  Total Records:        12
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:         12

       12 new DataItem instances created. 
mcap                Market Capitalization                        
mcapUS              Market Cap US$                               
lmcapUS             Latest Market Cap (US)                       
price               Price                                        
pe                  P/E Ratio                                    
pb                  P/B Ratio                                    
priceDate           Price Date                                   
sector              Industry Sector                              
industry            Industry                                     
country             Country                                      
secType             Security Type                                
assetCat            Asset Category                               


                    ---  End Reconcile for DataItemFeed  ---                    





                   ---  Begin Reconcile for DataItemFeed  ---                   

  Upload Feed:   DataItemFeed
  Total Records:         4
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for DataItemFeed  ---                    





                   ---  Begin Reconcile for DataItemFeed  ---                   

  Upload Feed:   DataItemFeed
  Total Records:         5
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for DataItemFeed  ---                    





                   ---  Begin Reconcile for DataItemFeed  ---                   

  Upload Feed:   DataItemFeed
  Total Records:         3
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for DataItemFeed  ---                    





                ---  Begin Reconcile for DataAccessPathFeed  ---                

  Upload Feed:   DataAccessPathFeed
  Total Records:         3
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          3

        3 new DataAccessPath instances created. 
Holding-Security    Holding-Security                             
Holding-Company     Holding-Company                              
Security-Company    Security-Company                             


                 ---  End Reconcile for DataAccessPathFeed  ---                 




Cleaning Object Space     1          Tables

      Current Allocation:     10,484,145.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 0
          Tables Cleaned:                 0


Cleaning Object Space     1    IndexedLists

 Current Allocation:          10,494,745.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space     1           Lists

 Current Allocation:          10,502,409.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space     1    Dictionaries

      Current Allocation:     10,508,153.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 0
    Dictionaries Cleaned:                 0


Cleaning Object Space     1     Descriptors

      Current Allocation:     10,514,921.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 0
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     2          Tables

      Current Allocation:     10,521,625.00
       Current Threshold:     2,000,000,000
       Tables Considered:                53
          Tables Cleaned:                 0


Cleaning Object Space     2    IndexedLists

 Current Allocation:          12,907,505.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      9
     ILists Cleaned:                      0


Cleaning Object Space     2           Lists

 Current Allocation:          12,911,321.00
  Current Threshold:          2,000,000,000
   Lists Considered:                     11
      Lists Cleaned:                      0


Cleaning Object Space     2    Dictionaries

      Current Allocation:     12,914,209.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:              1766
    Dictionaries Cleaned:                45


Cleaning Object Space     2     Descriptors

      Current Allocation:     12,980,817.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                16
     Descriptors Cleaned:                 5

--------------------------------------------------

Cleaning Object Space     3          Tables

      Current Allocation:     12,984,817.00
       Current Threshold:     2,000,000,000
       Tables Considered:               539
          Tables Cleaned:                62


Cleaning Object Space     3    IndexedLists

 Current Allocation:          21,244,493.00
  Current Threshold:          2,000,000,000
  ILists Considered:                    135
     ILists Cleaned:                     40


Cleaning Object Space     3           Lists

 Current Allocation:          21,250,353.00
  Current Threshold:          2,000,000,000
   Lists Considered:                    213
      Lists Cleaned:                     46


Cleaning Object Space     3    Dictionaries

      Current Allocation:     21,251,461.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:              6089
    Dictionaries Cleaned:               142


Cleaning Object Space     3     Descriptors

      Current Allocation:     21,442,449.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                79
     Descriptors Cleaned:                 2

--------------------------------------------------

Cleaning Object Space     4          Tables

      Current Allocation:     21,446,353.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 3
          Tables Cleaned:                 0


Cleaning Object Space     4    IndexedLists

 Current Allocation:          21,452,113.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space     4           Lists

 Current Allocation:          21,460,305.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space     4    Dictionaries

      Current Allocation:     21,460,305.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space     4     Descriptors

      Current Allocation:     21,460,333.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     5          Tables

      Current Allocation:     21,460,333.00
       Current Threshold:     2,000,000,000
       Tables Considered:                26
          Tables Cleaned:                 9


Cleaning Object Space     5    IndexedLists

 Current Allocation:          25,909,037.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      6
     ILists Cleaned:                      1


Cleaning Object Space     5           Lists

 Current Allocation:          25,915,829.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      6
      Lists Cleaned:                      0


Cleaning Object Space     5    Dictionaries

      Current Allocation:     25,915,829.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:               561
    Dictionaries Cleaned:                 3


Cleaning Object Space     5     Descriptors

      Current Allocation:     25,916,005.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:               409
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     6          Tables

      Current Allocation:     25,916,005.00
       Current Threshold:     2,000,000,000
       Tables Considered:               452
          Tables Cleaned:                34


Cleaning Object Space     6    IndexedLists

 Current Allocation:          27,276,953.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      3
     ILists Cleaned:                      1


Cleaning Object Space     6           Lists

 Current Allocation:          27,278,893.00
  Current Threshold:          2,000,000,000
   Lists Considered:                    150
      Lists Cleaned:                     24


Cleaning Object Space     6    Dictionaries

      Current Allocation:     27,279,565.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:               682
    Dictionaries Cleaned:                53


Cleaning Object Space     6     Descriptors

      Current Allocation:     27,281,085.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:               181
     Descriptors Cleaned:                 2

--------------------------------------------------

Cleaning Object Space     7          Tables

      Current Allocation:     27,281,149.00
       Current Threshold:     2,000,000,000
       Tables Considered:                28
          Tables Cleaned:                 8


Cleaning Object Space     7    IndexedLists

 Current Allocation:          27,311,149.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space     7           Lists

 Current Allocation:          27,311,149.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space     7    Dictionaries

      Current Allocation:     27,311,149.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                13
    Dictionaries Cleaned:                 2


Cleaning Object Space     7     Descriptors

      Current Allocation:     27,311,205.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 7
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     8          Tables

      Current Allocation:     27,311,205.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 4
          Tables Cleaned:                 0


Cleaning Object Space     8    IndexedLists

 Current Allocation:          27,473,109.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      4
     ILists Cleaned:                      0


Cleaning Object Space     8           Lists

 Current Allocation:          27,473,109.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      6
      Lists Cleaned:                      0


Cleaning Object Space     8    Dictionaries

      Current Allocation:     27,473,109.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:               134
    Dictionaries Cleaned:                 1


Cleaning Object Space     8     Descriptors

      Current Allocation:     27,473,137.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     9          Tables

      Current Allocation:     27,473,137.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 4
          Tables Cleaned:                 0


Cleaning Object Space     9    IndexedLists

 Current Allocation:          27,535,401.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      6
     ILists Cleaned:                      0


Cleaning Object Space     9           Lists

 Current Allocation:          27,535,401.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      8
      Lists Cleaned:                      0


Cleaning Object Space     9    Dictionaries

      Current Allocation:     27,535,401.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                48
    Dictionaries Cleaned:                 1


Cleaning Object Space     9     Descriptors

      Current Allocation:     27,535,429.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    10          Tables

      Current Allocation:     27,535,429.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 8
          Tables Cleaned:                 0


Cleaning Object Space    10    IndexedLists

 Current Allocation:          27,785,593.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      8
     ILists Cleaned:                      0


Cleaning Object Space    10           Lists

 Current Allocation:          27,786,617.00
  Current Threshold:          2,000,000,000
   Lists Considered:                     14
      Lists Cleaned:                      0


Cleaning Object Space    10    Dictionaries

      Current Allocation:     27,794,809.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:               201
    Dictionaries Cleaned:                 6


Cleaning Object Space    10     Descriptors

      Current Allocation:     27,794,977.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    11          Tables

      Current Allocation:     27,794,977.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 0


Cleaning Object Space    11    IndexedLists

 Current Allocation:          27,804,577.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    11           Lists

 Current Allocation:          27,804,577.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    11    Dictionaries

      Current Allocation:     27,804,577.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    11     Descriptors

      Current Allocation:     27,804,605.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    12          Tables

      Current Allocation:     27,804,605.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    12    IndexedLists

 Current Allocation:          27,817,085.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    12           Lists

 Current Allocation:          27,819,013.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    12    Dictionaries

      Current Allocation:     27,819,013.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    12     Descriptors

      Current Allocation:     27,819,041.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    13          Tables

      Current Allocation:     27,819,041.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    13    IndexedLists

 Current Allocation:          27,830,561.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    13           Lists

 Current Allocation:          27,830,561.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    13    Dictionaries

      Current Allocation:     27,830,561.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    13     Descriptors

      Current Allocation:     27,830,589.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    14          Tables

      Current Allocation:     27,830,589.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    14    IndexedLists

 Current Allocation:          27,842,109.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    14           Lists

 Current Allocation:          27,843,069.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    14    Dictionaries

      Current Allocation:     27,843,069.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    14     Descriptors

      Current Allocation:     27,843,097.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    15          Tables

      Current Allocation:     27,843,097.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    15    IndexedLists

 Current Allocation:          27,854,617.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    15           Lists

 Current Allocation:          27,854,617.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    15    Dictionaries

      Current Allocation:     27,854,617.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    15     Descriptors

      Current Allocation:     27,854,645.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    16          Tables

      Current Allocation:     27,854,645.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    16    IndexedLists

 Current Allocation:          27,866,165.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    16           Lists

 Current Allocation:          27,866,165.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    16    Dictionaries

      Current Allocation:     27,866,165.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    16     Descriptors

      Current Allocation:     27,874,385.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    17          Tables

      Current Allocation:     27,874,385.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    17    IndexedLists

 Current Allocation:          27,886,865.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    17           Lists

 Current Allocation:          27,886,865.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    17    Dictionaries

      Current Allocation:     27,886,865.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    17     Descriptors

      Current Allocation:     27,886,893.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    18          Tables

      Current Allocation:     27,886,893.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    18    IndexedLists

 Current Allocation:          27,899,381.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    18           Lists

 Current Allocation:          27,900,341.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    18    Dictionaries

      Current Allocation:     27,900,341.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    18     Descriptors

      Current Allocation:     27,900,369.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    19          Tables

      Current Allocation:     27,900,369.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    19    IndexedLists

 Current Allocation:          27,911,889.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    19           Lists

 Current Allocation:          27,912,849.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    19    Dictionaries

      Current Allocation:     27,912,849.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    19     Descriptors

      Current Allocation:     27,912,877.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    20          Tables

      Current Allocation:     27,912,877.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 0


Cleaning Object Space    20    IndexedLists

 Current Allocation:          27,924,397.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    20           Lists

 Current Allocation:          27,924,397.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    20    Dictionaries

      Current Allocation:     27,924,397.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    20     Descriptors

      Current Allocation:     27,924,425.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    21          Tables

      Current Allocation:     27,924,425.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 0


Cleaning Object Space    21    IndexedLists

 Current Allocation:          27,934,025.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    21           Lists

 Current Allocation:          27,934,025.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    21    Dictionaries

      Current Allocation:     27,934,025.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    21     Descriptors

      Current Allocation:     27,934,053.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    22          Tables

      Current Allocation:     27,934,053.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 0


Cleaning Object Space    22    IndexedLists

 Current Allocation:          27,943,653.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    22           Lists

 Current Allocation:          27,943,653.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    22    Dictionaries

      Current Allocation:     27,943,653.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    22     Descriptors

      Current Allocation:     27,943,681.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    23          Tables

      Current Allocation:     27,960,065.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 0


Cleaning Object Space    23    IndexedLists

 Current Allocation:          27,969,665.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    23           Lists

 Current Allocation:          27,970,633.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    23    Dictionaries

      Current Allocation:     27,970,633.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    23     Descriptors

      Current Allocation:     27,970,661.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    24          Tables

      Current Allocation:     27,970,661.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 0


Cleaning Object Space    24    IndexedLists

 Current Allocation:          27,979,301.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    24           Lists

 Current Allocation:          27,981,221.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    24    Dictionaries

      Current Allocation:     27,981,221.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    24     Descriptors

      Current Allocation:     27,981,249.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    25          Tables

      Current Allocation:     27,981,249.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 0


Cleaning Object Space    25    IndexedLists

 Current Allocation:          27,989,889.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    25           Lists

 Current Allocation:          27,989,889.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    25    Dictionaries

      Current Allocation:     27,989,889.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    25     Descriptors

      Current Allocation:     27,989,917.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------


--> Space Stats at End

Space       Containers   Size (kb)
0               18,635       5,100  Temporary
1                    2           0  BuiltInWorkspace
2               23,428       1,542  BuiltInWorkspace
3               82,212       5,644  CoreWorkspace
4                   51          11  Data Dictionary Management System
5               11,139       4,269  Schema Management Tools
6               12,016         796  Data Feed Management Tools
7                  359          27  Default Storage for DataRecord Instances
8                1,821         120  Storage for Security Properties
9                  755          50  Storage for Company Properties
10               2,700         179  Storage for Account Properties
11                 100          14  EOM Price History Storage As Of 1
12                 123          15  Annual Price History Storage As Of 1900
13                 123          15  Annual Price History Storage As Of 2012
14                 123          15  Annual Price History Storage As Of 2013
15                 123          15  Annual Price History Storage As Of 2014
16                 123          15  Annual Price History Storage As Of 2015
17                 123          15  Annual Price History Storage As Of 2016
18                 123          15  Annual Price History Storage As Of 2017
19                 123          15  Annual Price History Storage As Of 2018
20                 123          15  Annual Price History Storage As Of 2019
21                  98          13  Holdings Data As Of 1/1/1900
22                  98          13  Holdings Data As Of 1/1/2016
23                  98          13  Holdings Data As Of 1/1/2017
24                  98          13  Holdings Data As Of 1/1/2018
25                  98          13  Holdings Data As Of 1/1/2019

V> V> V> >>> Object Network Updated <<<

V> V> ---> Install Investment Core: Release 7 Protocol
Mon Jan 16 12:58:02 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> 
...  Miscellaneous core changes 


...  Miscellaneous core changes - DataFeed cleanups 



                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         3
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                   ---  End Reconcile for PropertySetup  ---                    





                  ---  Begin Reconcile for CurrencyMaster  ---                  

  Upload Feed:   CurrencyMaster
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new Currency instances created. 
GRD                 GRD                                          


                   ---  End Reconcile for CurrencyMaster  ---                   




...  Miscellaneous invest core changes 

Class SecurityIdRecord created in object space 8.
Property link between Security and SecurityIdRecord via idHistory defined. 
Use Entity Extender SecurityIdRecordFeed to update properties.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         5
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          5

        5 new properties created. 
SecurityIdRecord cusip (TS)       NA        NA   
SecurityIdRecord id (TS)       NA        NA   
SecurityIdRecord name (TS)       NA        NA   
SecurityIdRecord sedol (TS)       NA        NA   
SecurityIdRecord ticker (TS)       NA        NA   


                   ---  End Reconcile for PropertySetup  ---                    





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
Security parentSecurity (FP )       NA  Security  


                   ---  End Reconcile for PropertySetup  ---                    



Class PortfolioManager created.
Use MasterFeed PortfolioManagerMaster for instance creation.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
Account ticker (FP )       NA        NA   


                   ---  End Reconcile for PropertySetup  ---                    




...  Update schema and flag messages as needed

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:00 EST 2017
---  Current Counts  ---
CD:             288
MD:            3357
MID:           6802

---  Classes To Update  ---
Object
Collection
CoreWorkspace
Entity
Environment DBA DataFeed
Interface ApplicationWS
ProcessControlTools
ProcessControlTools ExternalProgram
DataFeed
Classification
Universe
GlobalsFeed
MasterFeed
MembershipFeed
ClassSetup
PropertySetup
MessageSetup
MasterFeedSetup
EntityExtenderFeedSetup
TransactionFeedSetup
MembershipFeedSetup
AliasFeedSetup
RangeGroupFeedSetup
CurrencyMaster
Interface BatchFeedManager
Security
Company
Account
Portfolio
AggAccount
IndexAccount
CompositeAccount
Country
Industry
Sector
Holding
SecurityMaster
SplitsFeed
DataItemFeed
DataAccessPathFeed
PortfolioMaster
AggAccountMaster
IndexAccountMaster
CompositeAccountMaster
MCapGroup
PEGroup
PBGroup
FundamentalData
AnalystEstimate
EconomicData
FundamentalDataA
FundamentalDataQ
FundamentalDataM
FundamentalA
FundamentalQ
FundamentalM
AnalystEst
EconFeed
McapGroups
PeGroups
PbGroups
SecurityIdRecord
SecurityIdRecordFeed
PortfolioManager
PortfolioManagerMaster

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:03 EST 2017
---  Current Counts  ---
CD:             288
MD:            3491
MID:           7212

      410 Created.
      606 Refreshed.


                   ---  Begin Reconcile for MessageSetup  ---                   

  Upload Feed:   MessageSetup
  Total Records:         8
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for MessageSetup  ---                    




...  Miscellaneous core changes 


...  Miscellaneous core changes - DataFeed cleanups 


...  Miscellaneous invest core changes 

Class IdXRef created.
Use MasterFeed IdXRefMaster for instance creation.
Class SedolId created.
Use MasterFeed SedolIdMaster for instance creation.
Class CusipId created.
Use MasterFeed CusipIdMaster for instance creation.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         2
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          2

        2 new properties created. 
CusipId security (TS) Security       NA   tracks securities with this cusip over time
SedolId security (TS) Security       NA   tracks securities with this sedol over time


                   ---  End Reconcile for PropertySetup  ---                    





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         2
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          2

        2 new properties created. 
Security rawSpinoffFactor (TS)       NA        NA   
Security spinoffAdjustmentFactor (TS)       NA  1.0  


                   ---  End Reconcile for PropertySetup  ---                    





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
DivRecord specialDivFlag (FP )       NA  FALSE  


                   ---  End Reconcile for PropertySetup  ---                    




...  Update schema and flag messages as needed

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:03 EST 2017
---  Current Counts  ---
CD:             294
MD:            3500
MID:           7223

---  Classes To Update  ---
Object
String
CoreWorkspace
Entity
Environment DBA DataFeed
DataFeed
Time
DataRecord
EntityExtenderFeed
RangeGroupFeed
ClassSetup
PropertySetup
MessageSetup
MasterFeedSetup
Interface BatchFeedManager
Security
Company
AggAccount
Holding
DivRecord
PriceRecord
ExchangeRateFeed
SplitsFeed
PriceFeed
EstimateRecordFeed
DivFeed
SecurityIdRecord
SecurityIdRecordFeed
IdXRef
IdXRefMaster
SedolId
SedolIdMaster
CusipId
CusipIdMaster

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:04 EST 2017
---  Current Counts  ---
CD:             294
MD:            3520
MID:           7298

       75 Created.
      129 Refreshed.

...  Miscellaneous core changes 


...  Miscellaneous core changes - DataFeed cleanups 

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:04 EST 2017
---  Current Counts  ---
CD:             294
MD:            3520
MID:           7298

---  Classes To Update  ---
Object
Boolean
String
Entity
DataFeed
DataRecord
MasterFeed
EntityExtenderFeed
PriceFeed
EstimateRecordFeed

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:04 EST 2017
---  Current Counts  ---
CD:             294
MD:            3539
MID:           7318

       20 Created.
       32 Refreshed.

...  Miscellaneous invest core changes 



                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
CompositeAccount weightingScheme (FP ) String       NA   Weighting scheme used to compute member weights


                   ---  End Reconcile for PropertySetup  ---                    





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         3
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          3

        3 new properties created. 
RangeClassification lowerBound (TS) Number       NA   Lower bound of range
RangeClassification rangeName (TS) String       NA   Name assigned to set
RangeClassification upperBound (TS) Number       NA   Upper bound of range


                   ---  End Reconcile for PropertySetup  ---                    




...  Update schema and flag messages as needed

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:04 EST 2017
---  Current Counts  ---
CD:             294
MD:            3540
MID:           7319

---  Classes To Update  ---
DataFeed
RangeClassification
EntityExtenderFeed
MembershipFeed
PropertySetup
Security
Company
Account
AggAccount
CompositeAccount
DivRecord
SplitsFeed
CompositeAccountMembers
HoldingsFeed
DivFeed
SecurityIdRecord
SecurityIdRecordFeed

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:04 EST 2017
---  Current Counts  ---
CD:             294
MD:            3565
MID:           7348

       29 Created.
       67 Refreshed.
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
  Loading patch.hostedSynch
  Mon Jan 16 12:58:04 EST 2017
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 


...  Miscellaneous core changes 



                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         3
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          3

        3 new properties created. 
VendorEntity pleaseDontLinkMe (FP ) Boolean       NA   Skip this instance when linking to primary entity.
VendorEntity pleaseLinkUsingThisId (FP ) String       NA   Use this value instead of the default when linking.
VendorEntity primaryEntityList (FP ) IndexedList IndexedList  Indexed List of PrimaryEntity instances referrencing this instance.


                   ---  End Reconcile for PropertySetup  ---                    




...  Miscellaneous feed changes 


...  Miscellaneous invest core changes 

--->  converting holdingsSeries t/s to Product Mapped storage


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
EstimateRecord reportedDate (FP ) Date       NA   Date actual was Reported


                   ---  End Reconcile for PropertySetup  ---                    





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
ConsensusEstimateRecord _stdDev (FP ) Double       NA   


                   ---  End Reconcile for PropertySetup  ---                    




...  Miscellaneous core changes - pre-federated 

Class Context created.
Use MasterFeed ContextMaster for instance creation.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
Context libraryId (FP )       NA        NA   


                   ---  End Reconcile for PropertySetup  ---                    





                 ---  Begin Reconcile for MasterFeedSetup  ---                  

  Upload Feed:   MasterFeedSetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

        1 new feed subclasses created. 
BrokerMaster (MasterFeed) Broker


                  ---  End Reconcile for MasterFeedSetup  ---                   



Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:04 EST 2017
---  Current Counts  ---
CD:             299
MD:            3577
MID:           7360

---  Classes To Update  ---
Object
DateRange
Collection
IndexedList
TimeSeries
Date
Number
Double
Integer
String
Utility SessionAttribute
CoreWorkspace
Date MonthDescriptor
Dictionary
Entity
Schema MessageDescriptor
Environment DBA DataFeed
Interface ExtractWS
ProcessControlTools
DataFeed
LowResolutionTime
HighResolutionTime
Currency
VendorEntity
DataRecord
EstimateRecord
ConsensusEstimateRecord
SummaryEstimateBridge
EntityExtenderFeed
XRefFeed
ClassSetup
PropertySetup
MasterFeedSetup
Interface ExternalFeedManager
Interface BatchFeedManager
Security
Account
Portfolio
AggAccount
IndexAccount
HoldingsFeed
EstimateRecordFeed
VendorDataRecord
Context
ContextMaster
ClientTools
BrokerMaster

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:05 EST 2017
---  Current Counts  ---
CD:             299
MD:            3695
MID:           7532

      172 Created.
      244 Refreshed.


                   ---  Begin Reconcile for MessageSetup  ---                   

  Upload Feed:   MessageSetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                    ---  End Reconcile for MessageSetup  ---                    



Indexing type of Security :pricingSeries:         2

Profile of Security :pricingSeries: - BEFORE
Level   Index   POP               Type        Cardinal         Size  Vision Class

  Store:  33554545 [   8, 113]    Index              2          236  TimeSeries
1       1                         Direct             0            0 
  Store:  33554543 [   8, 111]    List               2          160  List
2       1                         Direct             0            0 
  Store:  33554542 [   8, 110]    Property           2          132  Value
3       1                         Pointer            2           32 
  Store:  12664257 [   3, 81345]  Index              1          224  TimeSeries
4       1                         Direct             0            0 
  Store:  12664259 [   3, 81347]  List               1          152  List
5       1                         Direct             0            0 
  Store:  12664260 [   3, 81348]  Property           1          128  Value
6       1                         Pointer            1           28 
  Store:  12662829 [   3, 79917]  Table              1          340  PriceRecord






--------------------------------------------------------------------------------
1/1/1
Indexing type - before:         2
Indexing type - after:          1

1/1/1899
Indexing type - before:         2
Indexing type - after:          1

1/1/1900
Indexing type - before:         2
Indexing type - after:          1

1/1/2012
Indexing type - before:         2
Indexing type - after:          1

1/1/2013
Indexing type - before:         2
Indexing type - after:          1

1/1/2014
Indexing type - before:         2
Indexing type - after:          1

1/1/2015
Indexing type - before:         2
Indexing type - after:          1

1/1/2016
Indexing type - before:         2
Indexing type - after:          1

1/1/2017
Indexing type - before:         2
Indexing type - after:          1

1/1/2018
Indexing type - before:         2
Indexing type - after:          1

1/1/2019
Indexing type - before:         2
Indexing type - after:          1

Profile of Security :pricingSeries: - AFTER
Level   Index   POP               Type        Cardinal         Size  Vision Class

  Store:  33554545 [   8, 113]    Index              2          232  TimeSeries
1       1                         Direct             0            0 
  Store:  33554543 [   8, 111]    List               2          160  List
2       1                         Direct             0            0 
  Store:  33554542 [   8, 110]    Property           2          132  Value
3       1                         Pointer            2           32 
  Store:  12664257 [   3, 81345]  Index              1          224  TimeSeries
4       1                         Direct             0            0 
  Store:  12664259 [   3, 81347]  List               1          152  List
5       1                         Direct             0            0 
  Store:  12664260 [   3, 81348]  Property           1          128  Value
6       1                         Pointer            1           28 
  Store:  12662829 [   3, 79917]  Table              1          340  PriceRecord







- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
  End of patch.hostedSynch
  Mon Jan 16 12:58:05 EST 2017
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:05 EST 2017
---  Current Counts  ---
CD:             299
MD:            3695
MID:           7532

---  Classes To Update  ---
DataFeed
MessageSetup

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:05 EST 2017
---  Current Counts  ---
CD:             299
MD:            3695
MID:           7532

        0 Created.
        7 Refreshed.
Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:05 EST 2017
---  Current Counts  ---
CD:             299
MD:            3695
MID:           7532

---  Classes To Update  ---
Object
DateRange
Block
Primitive
Collection
TimeSeries
List
Date
Number
Integer
String
Utility UnixSeconds
Catalog
EntityCatalog
Chain
Dictionary
Entity
IncorporatorPrototype
PrinterTools Descriptor
Schema
Schema ClassDescriptor
Schema MessageDescriptor
Schema MessageImplementationDescriptor
AdminTools
AdminTools ObjectSpace
AdminTools _POP
Interface ErrorLog
Interface ExtractWS
Interface ApplicationWS
FormatToolProtocol Html
LayoutTools TableSpec
LayoutTools TableSpec ColumnSpec
LayoutTools FormSpec
LayoutTools FormSpec InputSpec
LayoutTools Piechart
LayoutTools Barchart
LayoutTools Linechart
LayoutTools Barchart DataSet
LayoutTools Linechart DataSet
ProcessControlTools
DataSource
DataFeed
DataSet
Time
LowResolutionTime
HighResolutionTime
Currency
Classification
Universe
DataItem
VendorEntity
DataRecord
LinkRecord
Bridge
EstimateBridge
EstimateRecord
SummaryEstimateBridge
GlobalsFeed
MasterFeed
EntityExtenderFeed
SchemaFeeds
ClassSetup
PropertySetup
MessageSetup
DataFeedSetup
EntityExtenderFeedSetup
UniverseMembers
Interface ExternalFeedManager
Security
Company
Account
Portfolio
AggAccount
IndexAccount
CompositeAccount
Country
Industry
Sector
DataType
Holding
PriceTools
SecurityMaster
ExchangeRateFeed
SplitsFeed
PriceFeed
IndexAccountBuilder
HoldingsFeed
EstimateRecordFeed
DivFeed
SecurityIdRecord

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:05 EST 2017
---  Current Counts  ---
CD:             299
MD:            3695
MID:           7532

        0 Created.
      364 Refreshed.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         4
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          4

        4 new properties created. 
Security adrFlag (FP )       NA  FALSE  
Security adrRatio (FP ) Double       NA   
Security lastPricingDate (FP ) Date       NA   
Security tradingCountry (FP )       NA  Country  


                   ---  End Reconcile for PropertySetup  ---                    



Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:05 EST 2017
---  Current Counts  ---
CD:             308
MD:            3699
MID:           7536

---  Classes To Update  ---
Object
CoreWorkspace
Environment DBA DataFeed
DataFeed
PropertySetup
Security
Holding
PriceTools
CorrectionFeed
SecurityCorrectionFeed
StitchSecurityFeed
UnstitchSecurityFeed
RemoveSecurityFeed
RemoveCompanyFeed
MoveSecurityInfoFeed
CanadianIdChangeFeed
ReuseSecurityIdFeed

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:06 EST 2017
---  Current Counts  ---
CD:             308
MD:            3763
MID:           7737

      201 Created.
      218 Refreshed.
Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:06 EST 2017
---  Current Counts  ---
CD:             325
MD:            3768
MID:           7742

---  Classes To Update  ---
Object
String
CoreWorkspace
FormatToolProtocol
Interface
Interface Global
Interface ApplicationWS
FormatToolProtocol Html
Interface HtmlAccess
LayoutTools
LayoutTools Specification
LayoutTools Component
LayoutTools TableSpec
LayoutTools TableSpec Label
LayoutTools TableSpec ColumnSpec
LayoutTools FormSpec
LayoutTools FormSpec InputSpec
Interface RequestWS
LayoutTools OptionBarSpec
LayoutTools OptionBarSpec Entry
LayoutTools TableSpec FillerRow
LayoutTools DialogFormSpec
LayoutTools DialogFormSpec Section
LayoutTools WrapperSpec
ReportTools
ReportTools Specification
ReportTools GroupSpec
ReportTools ApplicationSpec
ReportTools Named
ReportTools Global
FormatToolProtocol CSV
FormatToolProtocol Html_Xls
FormatToolProtocol Xml
FormatToolProtocol DDO

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:06 EST 2017
---  Current Counts  ---
CD:             325
MD:            4146
MID:           8364

      622 Created.
      669 Refreshed.
Class Statistic created.
Use MasterFeed StatisticMaster for instance creation.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         4
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          4

        4 new properties created. 
DataItem statSet (FP ) Statistic       NA   
Statistic accessBlock (FP ) Block       NA   
Statistic isCount (FP ) Boolean FALSE  
Statistic isPercent (FP ) Boolean FALSE  


                   ---  End Reconcile for PropertySetup  ---                    





                 ---  Begin Reconcile for StatisticMaster  ---                  

  Upload Feed:   StatisticMaster
  Total Records:        17
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:         17

       17 new Statistic instances created. 
countGoodOnes       Number Available                             
percentAvailable    Percent Available                            
weightedAverage     Wtd Average                                  
average             Average                                      
total               Sum                                          
median              Median                                       
min                 Min                                          
max                 Max                                          
stdDev              Standard Dev                                 
countPositives      Positives                                    
countNegatives      Negatives                                    
countZeros          Zeros                                        
harmonicMean        Harmonic Avg                                 
weightedHarmonicMeanWtd Harmonic Avg                             
weightedMedian      Wtd Median                                   
adjustedTotal       Adjusted Total                               
sumNumToSumDen      Sum Numerator-to-Sum Denominator             


                  ---  End Reconcile for StatisticMaster  ---                   



Class Application created.
Use MasterFeed ApplicationMaster for instance creation.
Class ApplicationParam created.
Use MasterFeed ApplicationParamMaster for instance creation.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         5
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          5

        5 new properties created. 
Application description (FP ) String       NA   
ApplicationParam allowList (FP ) Boolean FALSE  
ApplicationParam description1 (FP ) String       NA   
ApplicationParam description2 (FP ) String       NA   
ApplicationParam type (FP ) String       NA   


                   ---  End Reconcile for PropertySetup  ---                    





               ---  Begin Reconcile for MembershipFeedSetup  ---                

  Upload Feed:   MembershipFeedSetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0

        1 new feed subclasses created. 
ApplicationParameters (MembershipFeed) Application parameterList ApplicationParam       NA  APPEND


                ---  End Reconcile for MembershipFeedSetup  ---                 



Class Library created.
Use MasterFeed LibraryMaster for instance creation.
Class FormulaLibrary created.
Use MasterFeed FormulaLibraryMaster for instance creation.
Class AccountFormulaLibrary created.
Use MasterFeed AccountFormulaLibraryMaster for instance creation.
Class SecurityFormulaLibrary created.
Use MasterFeed SecurityFormulaLibraryMaster for instance creation.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         2
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          2

        2 new properties created. 
Library homeLocation (FP )       NA  String  Network Path or Site name
Library root (FP )       NA  String  Library Class (e.g. CompustatAnnualCalcs)


                   ---  End Reconcile for PropertySetup  ---                    





                   ---  Begin Reconcile for DataItemFeed  ---                   

  Upload Feed:   DataItemFeed
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new DataItem instances created. 
pct                 % Port                                       


                    ---  End Reconcile for DataItemFeed  ---                    





                   ---  Begin Reconcile for DataItemFeed  ---                   

  Upload Feed:   DataItemFeed
  Total Records:        14
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          9

        9 new DataItem instances created. 
epsGrow3Yr          epsGrow3Yr                                   
epsGrow5Yr          epsGrow5Yr                                   
mval                mval                                         
pcf                 pcf                                          
pcte                pcte                                         
peEst1              peEst1                                       
peEst2              peEst2                                       
return1m            return1m                                     
yield               yield                                        


                    ---  End Reconcile for DataItemFeed  ---                    



Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:06 EST 2017
---  Current Counts  ---
CD:             354
MD:            4169
MID:           8388

---  Classes To Update  ---
Object
Boolean
FALSE
TRUE
IndexedList
Date
Number
Double
Float
Integer
String
Undefined
CoreWorkspace
Entity
Schema MessageImplementationDescriptor
Environment DBA DataFeed
Interface ApplicationWS
ProcessControlTools
DataFeed
Time
LowResolutionTime
HighResolutionTime
Currency
DataItem
IdSource
ClassSetup
PropertySetup
MasterFeedSetup
MembershipFeedSetup
Interface BatchFeedManager
Security
Account
DataItemFeed
ApplicationTools
ApplicationTools Named
ApplicationTools ViewerModule
ApplicationTools AccountViewer
ApplicationTools SecurityViewer
ApplicationTools SupportView
ApplicationTools ViewerModule DisplayObject
ApplicationTools CalcPackage
ApplicationTools SecurityCalcs
ApplicationTools AccountCalcs
Statistic
StatisticMaster
Application
ApplicationMaster
ApplicationParam
ApplicationParamMaster
ApplicationParameters
Library
LibraryMaster
FormulaLibrary
FormulaLibraryMaster
AccountFormulaLibrary
AccountFormulaLibraryMaster
SecurityFormulaLibrary
SecurityFormulaLibraryMaster
GenericTools
GenericTools LibraryTools
DBMapTools
CalcPackageTools

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:08 EST 2017
---  Current Counts  ---
CD:             354
MD:            4394
MID:           8890

      502 Created.
      563 Refreshed.
Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:08 EST 2017
---  Current Counts  ---
CD:             354
MD:            4394
MID:           8890

---  Classes To Update  ---

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:08 EST 2017
---  Current Counts  ---
CD:             354
MD:            4394
MID:           8890

        0 Created.
        0 Refreshed.
>>> Object Network Updated <<<

V> V> V> V> ---> Admin Cleanup
Mon Jan 16 12:58:08 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> V> V> V> 
                            ---  Object Spaces ---                              

         3CoreWorkspace
         2BuiltInWorkspace
         2BuiltInWorkspace
         3CoreWorkspace
         4Environment DBA DDMS
         5Environment DBA Schema
         6Environment DBA DataFeed
         7Environment DBA DataRecordClasses
         8Environment DBA SecurityClass
         9Environment DBA CompanyClass
        10Environment DBA AccountClass
        11Environment DB EOMPrice1
        12Environment DB DailyPrice1900
        13Environment DB DailyPrice2012
        14Environment DB DailyPrice2013
        15Environment DB DailyPrice2014
        16Environment DB DailyPrice2015
        17Environment DB DailyPrice2016
        18Environment DB DailyPrice2017
        19Environment DB DailyPrice2018
        20Environment DB DailyPrice2019
        21Environment DB Holdings19000101
        22Environment DB Holdings20160101
        23Environment DB Holdings20170101
        24Environment DB Holdings20180101
        25Environment DB Holdings20190101


Cleaning Object Space     1          Tables

      Current Allocation:      1,949,732.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 0
          Tables Cleaned:                 0


Cleaning Object Space     1    IndexedLists

 Current Allocation:           1,975,700.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space     1           Lists

 Current Allocation:           1,982,428.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space     1    Dictionaries

      Current Allocation:      1,989,196.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 0
    Dictionaries Cleaned:                 0


Cleaning Object Space     1     Descriptors

      Current Allocation:      1,995,900.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 0
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     2          Tables

      Current Allocation:      2,002,604.00
       Current Threshold:     2,000,000,000
       Tables Considered:                58
          Tables Cleaned:                 0


Cleaning Object Space     2    IndexedLists

 Current Allocation:           5,194,300.00
  Current Threshold:          2,000,000,000
  ILists Considered:                     10
     ILists Cleaned:                      0


Cleaning Object Space     2           Lists

 Current Allocation:           5,197,180.00
  Current Threshold:          2,000,000,000
   Lists Considered:                     12
      Lists Cleaned:                      0


Cleaning Object Space     2    Dictionaries

      Current Allocation:      5,198,148.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:              2210
    Dictionaries Cleaned:                28


Cleaning Object Space     2     Descriptors

      Current Allocation:      5,462,868.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                19
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     3          Tables

      Current Allocation:      5,466,708.00
       Current Threshold:     2,000,000,000
       Tables Considered:               729
          Tables Cleaned:                59


Cleaning Object Space     3    IndexedLists

 Current Allocation:          21,850,492.00
  Current Threshold:          2,000,000,000
  ILists Considered:                    203
     ILists Cleaned:                     28


Cleaning Object Space     3           Lists

 Current Allocation:          21,854,708.00
  Current Threshold:          2,000,000,000
   Lists Considered:                    307
      Lists Cleaned:                     17


Cleaning Object Space     3    Dictionaries

      Current Allocation:     21,855,088.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:             11074
    Dictionaries Cleaned:                88


Cleaning Object Space     3     Descriptors

      Current Allocation:     22,117,300.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:               145
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     4          Tables

      Current Allocation:     22,119,220.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 3
          Tables Cleaned:                 0


Cleaning Object Space     4    IndexedLists

 Current Allocation:          22,124,028.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space     4           Lists

 Current Allocation:          22,124,028.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space     4    Dictionaries

      Current Allocation:     22,124,028.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 0


Cleaning Object Space     4     Descriptors

      Current Allocation:     22,124,028.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     5          Tables

      Current Allocation:     22,132,220.00
       Current Threshold:     2,000,000,000
       Tables Considered:                26
          Tables Cleaned:                 0


Cleaning Object Space     5    IndexedLists

 Current Allocation:          25,368,492.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      6
     ILists Cleaned:                      2


Cleaning Object Space     5           Lists

 Current Allocation:          25,374,912.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      7
      Lists Cleaned:                      1


Cleaning Object Space     5    Dictionaries

      Current Allocation:     25,374,932.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:              1040
    Dictionaries Cleaned:                 2


Cleaning Object Space     5     Descriptors

      Current Allocation:     25,374,988.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:               607
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     6          Tables

      Current Allocation:     25,374,988.00
       Current Threshold:     2,000,000,000
       Tables Considered:               691
          Tables Cleaned:                29


Cleaning Object Space     6    IndexedLists

 Current Allocation:          29,547,264.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      8
     ILists Cleaned:                      2


Cleaning Object Space     6           Lists

 Current Allocation:          29,551,208.00
  Current Threshold:          2,000,000,000
   Lists Considered:                    261
      Lists Cleaned:                     15


Cleaning Object Space     6    Dictionaries

      Current Allocation:     29,551,628.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:              2112
    Dictionaries Cleaned:                27


Cleaning Object Space     6     Descriptors

      Current Allocation:     29,552,364.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:               385
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     7          Tables

      Current Allocation:     29,552,364.00
       Current Threshold:     2,000,000,000
       Tables Considered:                33
          Tables Cleaned:                13


Cleaning Object Space     7    IndexedLists

 Current Allocation:          29,769,488.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space     7           Lists

 Current Allocation:          29,771,408.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      7
      Lists Cleaned:                      0


Cleaning Object Space     7    Dictionaries

      Current Allocation:     29,771,408.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:               111
    Dictionaries Cleaned:                 1


Cleaning Object Space     7     Descriptors

      Current Allocation:     29,771,436.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                37
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space     8          Tables

      Current Allocation:     29,771,436.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 8
          Tables Cleaned:                 4


Cleaning Object Space     8    IndexedLists

 Current Allocation:          30,305,900.00
  Current Threshold:          2,000,000,000
  ILists Considered:                     10
     ILists Cleaned:                      0


Cleaning Object Space     8           Lists

 Current Allocation:          30,306,860.00
  Current Threshold:          2,000,000,000
   Lists Considered:                     13
      Lists Cleaned:                      1


Cleaning Object Space     8    Dictionaries

      Current Allocation:     30,306,888.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:               401
    Dictionaries Cleaned:                 1


Cleaning Object Space     8     Descriptors

      Current Allocation:     30,306,916.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 7
     Descriptors Cleaned:                 1

--------------------------------------------------

Cleaning Object Space     9          Tables

      Current Allocation:     30,306,944.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 4
          Tables Cleaned:                 0


Cleaning Object Space     9    IndexedLists

 Current Allocation:          30,663,456.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      6
     ILists Cleaned:                      0


Cleaning Object Space     9           Lists

 Current Allocation:          30,664,424.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      8
      Lists Cleaned:                      0


Cleaning Object Space     9    Dictionaries

      Current Allocation:     30,664,424.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:               287
    Dictionaries Cleaned:                 1


Cleaning Object Space     9     Descriptors

      Current Allocation:     30,664,452.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    10          Tables

      Current Allocation:     30,664,452.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 8
          Tables Cleaned:                 0


Cleaning Object Space    10    IndexedLists

 Current Allocation:          31,708,504.00
  Current Threshold:          2,000,000,000
  ILists Considered:                     11
     ILists Cleaned:                      0


Cleaning Object Space    10           Lists

 Current Allocation:          31,710,488.00
  Current Threshold:          2,000,000,000
   Lists Considered:                     17
      Lists Cleaned:                      0


Cleaning Object Space    10    Dictionaries

      Current Allocation:     31,710,488.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:               783
    Dictionaries Cleaned:                 1


Cleaning Object Space    10     Descriptors

      Current Allocation:     31,710,516.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    11          Tables

      Current Allocation:     31,710,516.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 1


Cleaning Object Space    11    IndexedLists

 Current Allocation:          31,727,376.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    11           Lists

 Current Allocation:          31,727,376.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    11    Dictionaries

      Current Allocation:     31,727,376.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    11     Descriptors

      Current Allocation:     31,727,404.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    12          Tables

      Current Allocation:     31,727,404.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    12    IndexedLists

 Current Allocation:          31,737,992.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    12           Lists

 Current Allocation:          31,737,992.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    12    Dictionaries

      Current Allocation:     31,737,992.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    12     Descriptors

      Current Allocation:     31,738,020.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    13          Tables

      Current Allocation:     31,738,020.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    13    IndexedLists

 Current Allocation:          31,748,608.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    13           Lists

 Current Allocation:          31,748,608.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    13    Dictionaries

      Current Allocation:     31,748,608.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    13     Descriptors

      Current Allocation:     31,748,636.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    14          Tables

      Current Allocation:     31,748,636.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    14    IndexedLists

 Current Allocation:          31,758,264.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    14           Lists

 Current Allocation:          31,758,264.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    14    Dictionaries

      Current Allocation:     31,758,264.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    14     Descriptors

      Current Allocation:     31,758,292.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    15          Tables

      Current Allocation:     31,758,292.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    15    IndexedLists

 Current Allocation:          31,768,880.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    15           Lists

 Current Allocation:          31,768,880.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    15    Dictionaries

      Current Allocation:     31,768,880.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    15     Descriptors

      Current Allocation:     31,768,908.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    16          Tables

      Current Allocation:     31,768,908.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    16    IndexedLists

 Current Allocation:          31,779,496.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    16           Lists

 Current Allocation:          31,779,496.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    16    Dictionaries

      Current Allocation:     31,779,496.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    16     Descriptors

      Current Allocation:     31,779,524.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    17          Tables

      Current Allocation:     31,779,524.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    17    IndexedLists

 Current Allocation:          31,790,112.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    17           Lists

 Current Allocation:          31,798,304.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    17    Dictionaries

      Current Allocation:     31,798,304.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    17     Descriptors

      Current Allocation:     31,798,332.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    18          Tables

      Current Allocation:     31,798,332.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    18    IndexedLists

 Current Allocation:          31,808,920.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    18           Lists

 Current Allocation:          31,808,920.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    18    Dictionaries

      Current Allocation:     31,808,920.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    18     Descriptors

      Current Allocation:     31,808,948.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    19          Tables

      Current Allocation:     31,808,948.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    19    IndexedLists

 Current Allocation:          31,819,536.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    19           Lists

 Current Allocation:          31,819,536.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    19    Dictionaries

      Current Allocation:     31,819,536.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    19     Descriptors

      Current Allocation:     31,819,564.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    20          Tables

      Current Allocation:     31,819,564.00
       Current Threshold:     2,000,000,000
       Tables Considered:                11
          Tables Cleaned:                 1


Cleaning Object Space    20    IndexedLists

 Current Allocation:          31,830,152.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      1
     ILists Cleaned:                      0


Cleaning Object Space    20           Lists

 Current Allocation:          31,830,152.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      1
      Lists Cleaned:                      0


Cleaning Object Space    20    Dictionaries

      Current Allocation:     31,830,152.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    20     Descriptors

      Current Allocation:     31,830,180.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    21          Tables

      Current Allocation:     31,830,180.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 1


Cleaning Object Space    21    IndexedLists

 Current Allocation:          31,838,848.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    21           Lists

 Current Allocation:          31,838,848.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    21    Dictionaries

      Current Allocation:     31,838,848.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    21     Descriptors

      Current Allocation:     31,838,876.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    22          Tables

      Current Allocation:     31,838,876.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 1


Cleaning Object Space    22    IndexedLists

 Current Allocation:          31,846,584.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    22           Lists

 Current Allocation:          31,846,584.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    22    Dictionaries

      Current Allocation:     31,846,584.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    22     Descriptors

      Current Allocation:     31,846,612.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    23          Tables

      Current Allocation:     31,846,612.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 1


Cleaning Object Space    23    IndexedLists

 Current Allocation:          31,855,280.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    23           Lists

 Current Allocation:          31,855,280.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    23    Dictionaries

      Current Allocation:     31,863,472.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    23     Descriptors

      Current Allocation:     31,863,500.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    24          Tables

      Current Allocation:     31,863,500.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 1


Cleaning Object Space    24    IndexedLists

 Current Allocation:          31,872,168.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    24           Lists

 Current Allocation:          31,872,168.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    24    Dictionaries

      Current Allocation:     31,872,168.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    24     Descriptors

      Current Allocation:     31,872,196.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------

Cleaning Object Space    25          Tables

      Current Allocation:     31,872,196.00
       Current Threshold:     2,000,000,000
       Tables Considered:                 6
          Tables Cleaned:                 1


Cleaning Object Space    25    IndexedLists

 Current Allocation:          31,880,864.00
  Current Threshold:          2,000,000,000
  ILists Considered:                      0
     ILists Cleaned:                      0


Cleaning Object Space    25           Lists

 Current Allocation:          31,880,864.00
  Current Threshold:          2,000,000,000
   Lists Considered:                      0
      Lists Cleaned:                      0


Cleaning Object Space    25    Dictionaries

      Current Allocation:     31,880,864.00
       Current Threshold:     2,000,000,000
 Dictionaries Considered:                 1
    Dictionaries Cleaned:                 1


Cleaning Object Space    25     Descriptors

      Current Allocation:     31,880,892.00
       Current Threshold:     2,000,000,000
  Descriptors Considered:                 1
     Descriptors Cleaned:                 0

--------------------------------------------------
>>> Object Network Updated <<<

V> V> V> V> V> V> V> V> V> V> V> ---> Install upgrades/builtin
Mon Jan 16 12:58:10 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> Class PatchTable created.
Use MasterFeed PatchTableMaster for instance creation.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         2
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          2

        2 new properties created. 
PatchTable module (FP ) String       NA   
PatchTable patchLevel (FP ) Integer 0  


                   ---  End Reconcile for PropertySetup  ---                    





                 ---  Begin Reconcile for PatchTableMaster  ---                 

  Upload Feed:   PatchTableMaster
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new PatchTable instances created. 
builtin             Builtin Vision Protocol                      


                  ---  End Reconcile for PatchTableMaster  ---                  





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
DataItem cap (FP ) Double       NA   


                   ---  End Reconcile for PropertySetup  ---                    




####################
#  Dictionary: Protocol
####################

Class Statistic is already a subclass of Entity
Use MasterFeed StatisticMaster for instance creation.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         4
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          0


                   ---  End Reconcile for PropertySetup  ---                    





                 ---  Begin Reconcile for StatisticMaster  ---                  

  Upload Feed:   StatisticMaster
  Total Records:        27
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:         12

       12 new Statistic instances created. 
pctPositives        % Positives                                  
pctNegatives        % Negatives                                  
pctZeros            % Zeros                                      
averageNoNegs       Average (no negs)                            
average2Std         Average 2 std dev                            
average2StdNoNegs   Average 2 std dev (no negs)                  
weightedAverageNoNegWtd Average (no negs)                        
weightedAverage2Std Wtd Average 2 std dev                        
weightedAverage2StdNWtd Average 2 std dev (no negs)              
weightedHAverage2StdWtd Harmonic Average 2 std dev               
weightedAverageCappeWtd Average Capped                           
weightedAverageInterWtd Average InterQuartile                    


                  ---  End Reconcile for StatisticMaster  ---                   



Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:08 EST 2017
---  Current Counts  ---
CD:             357
MD:            4404
MID:           8900

---  Classes To Update  ---
Object
Boolean
FALSE
TRUE
Collection
IndexedList
TimeSeries
List
Date
Number
Integer
String
Undefined
Utility
Utility SessionAttribute
CoreWorkspace
Dictionary
Entity
Environment DBA DataFeed
ProcessControlTools
DataFeed
Time
LowResolutionTime
HighResolutionTime
Currency
DataItem
DataRecord
ClassSetup
PropertySetup
MasterFeedSetup
Interface BatchFeedManager
Statistic
StatisticMaster
PatchTable
PatchTableMaster
ProcessControlTools State

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:11 EST 2017
---  Current Counts  ---
CD:             357
MD:            4496
MID:           9041

      141 Created.
      202 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Install upgrades/investment
Mon Jan 16 12:58:11 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> V> 

                 ---  Begin Reconcile for PatchTableMaster  ---                 

  Upload Feed:   PatchTableMaster
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new PatchTable instances created. 
Investment          Account, Broker, Company, EstimateBridge, Sec


                  ---  End Reconcile for PatchTableMaster  ---                  





                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
DivRecord _specialDiv (FP ) Double       NA  CURRENCY PERSHARE unadjusted special dividend


                   ---  End Reconcile for PropertySetup  ---                    



Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:11 EST 2017
---  Current Counts  ---
CD:             357
MD:            4498
MID:           9043

---  Classes To Update  ---
DataFeed
PropertySetup
Security
Account
IndexAccount
Holding
DivRecord
PatchTableMaster

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:11 EST 2017
---  Current Counts  ---
CD:             357
MD:            4505
MID:           9057

       14 Created.
       33 Refreshed.
>>> Object Network Updated <<<

V> V> ---> Install upgrades/datafeed
Mon Jan 16 12:58:11 EST 2017
Type:
    ?d         ... to invoke the debugger.
    ?f         ... to erase the current program.
    ?g         ... to compile and run the current program.
    ?l         ... to compile and run the last program.
    ?r[count]  ... to compile and repeated run the current program.
    ?c         ... to compile the current program.
    ?s         ... to display the current program.
    ?S         ... to display the last program.
    ?t         ... to display compile and run times of the last program.
    ?e         ... to toggle input echo.
    ?w         ... to save the global environment.

Any thing else will get appended to the current input buffer.

V> V> V> V> V> V> Class IndexedDataRecord created.
Setting 'entity' on Default IndexedDataRecord to Default Entity
No property link defined as access path.
Use Entity Extender IndexedDataRecordFeed to update properties.


                  ---  Begin Reconcile for PropertySetup  ---                   

  Upload Feed:   PropertySetup
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new properties created. 
IndexedDataRecord index (FP )       NA        NA   


                   ---  End Reconcile for PropertySetup  ---                    





                 ---  Begin Reconcile for PatchTableMaster  ---                 

  Upload Feed:   PatchTableMaster
  Total Records:         1
  Bad Field Ids:         0
  Not Processed:         0
  Other Status:          1

        1 new PatchTable instances created. 
DataFeed            DataFeed Protocol                            


                  ---  End Reconcile for PatchTableMaster  ---                  



Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:11 EST 2017
---  Current Counts  ---
CD:             359
MD:            4508
MID:           9061

---  Classes To Update  ---
Object
CoreWorkspace
Environment DBA DataFeed
DataFeed
ClassSetup
PropertySetup
EntityExtenderFeedSetup
Interface ExternalFeedManager
Interface BatchFeedManager
PatchTableMaster
IndexedDataRecord
IndexedDataRecordFeed

...  Creating New Messages
...  Refreshing Messages
...  Cleanup

Schema Message Cross Reference Last Updated: Mon Jan 16 12:58:12 EST 2017
---  Current Counts  ---
CD:             359
MD:            4521
MID:           9098

       37 Created.
       55 Refreshed.
>>> Object Network Updated <<<

V> V> %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%    Creating Schema Cross Reference Documentation    %%%
Running /home/mikey/vision-open-source/software/builds/current/bin/batchvision in /home/mikey/vision-open-source/application/localvision/bootstrap/investNet/NDF
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> V> 